#Main Heading
## Sub Heading
### One more level down

# 10th August - Class 3

In [1]:
print("Hello")

Hello

In [2]:
print("Hi")

Hi

In [3]:
import pandas as pd

In [4]:
pd.__version__

'0.24.2'

In [6]:
#Defining a dataframe. This is rarely used as all dataframes are imported from another format. This is how we import DataFrame
# as a list not as a dictionary
pd.DataFrame([[1,"San",30000,],[2,"Ram",40000]],index = [0,1],columns = ["ID","Name","Salary"])

   ID Name  Salary
0   1  San   30000
1   2  Ram   40000

In [7]:
pd.DataFrame({"id":[1,2,3,4],"Name":["A","B","C","D"]})
#this is more a dictionary

   id Name
0   1    A
1   2    B
2   3    C
3   4    D

In [9]:
pd.DataFrame({"id":[1,2,3,4],"Name":["A","B","C","D"]},index = [10,20,30,40])

    id Name
10   1    A
20   2    B
30   3    C
40   4    D

In [10]:
pd.DataFrame({"id":[1,2,3,4],"Name":["A","B","C","D"]},index = [10,20,30,40]).values

array([[1, 'A'],
       [2, 'B'],
       [3, 'C'],
       [4, 'D']], dtype=object)

In [11]:
#Creating a series
pd.Series([1,2,3,4])

0    1
1    2
2    3
3    4
dtype: int64

In [12]:
#Creating a series
pd.Series([1,2,3,4],index = [10,20,30,40])

10    1
20    2
30    3
40    4
dtype: int64

In [21]:
# How to read a csv files using pandas. How easy it is!
new_excel = pd.read_excel("C:/Users/tin2419/Desktop/Time Report.xlsx")
#,skiprows=4,nrows=1000)

In [93]:
help(pd.read_excel)

Help on function read_excel in module pandas.io.excel:

read_excel(io, sheet_name=0, header=0, names=None, index_col=None, parse_cols=None, usecols=None, squeeze=False, dtype=None, engine=None, converters=None, true_values=None, false_values=None, skiprows=None, nrows=None, na_values=None, keep_default_na=True, verbose=False, parse_dates=False, date_parser=None, thousands=None, comment=None, skip_footer=0, skipfooter=0, convert_float=True, mangle_dupe_cols=True, **kwds)
    Read an Excel file into a pandas DataFrame.

    Support both `xls` and `xlsx` file extensions from a local filesystem or URL.
    Support an option to read a single sheet or a list of sheets.

    Parameters
    ----------
    io : str, file descriptor, pathlib.Path, ExcelFile or xlrd.Book
        The string could be a URL. Valid URL schemes include http, ftp, s3,
        gcs, and file. For file URLs, a host is expected. For instance, a local
        file could be /path/to/workbook.xlsx.
    sheet_name : str, int, list, or None, default 0
        Strings are used for sheet names. Integers are used in zero-indexed
        sheet positions. Lists of strings/integers are used to request
        multiple sheets. Specify None to get all sheets.

        Available cases:

        * Defaults to ``0``: 1st sheet as a `DataFrame`
        * ``1``: 2nd sheet as a `DataFrame`
        * ``"Sheet1"``: Load sheet with name "Sheet1"
        * ``[0, 1, "Sheet5"]``: Load first, second and sheet named "Sheet5"
          as a dict of `DataFrame`
        * None: All sheets.

    header : int, list of int, default 0
        Row (0-indexed) to use for the column labels of the parsed
        DataFrame. If a list of integers is passed those row positions will
        be combined into a ``MultiIndex``. Use None if there is no header.
    names : array-like, default None
        List of column names to use. If file contains no header row,
        then you should explicitly pass header=None.
    index_col : int, list of int, default None
        Column (0-indexed) to use as the row labels of the DataFrame.
        Pass None if there is no such column.  If a list is passed,
        those columns will be combined into a ``MultiIndex``.  If a
        subset of data is selected with ``usecols``, index_col
        is based on the subset.
    parse_cols : int or list, default None
        Alias of `usecols`.

        .. deprecated:: 0.21.0
           Use `usecols` instead.

    usecols : int, str, list-like, or callable default None
        Return a subset of the columns.
        * If None, then parse all columns.
        * If int, then indicates last column to be parsed.

        .. deprecated:: 0.24.0
           Pass in a list of int instead from 0 to `usecols` inclusive.

        * If str, then indicates comma separated list of Excel column letters
          and column ranges (e.g. "A:E" or "A,C,E:F"). Ranges are inclusive of
          both sides.
        * If list of int, then indicates list of column numbers to be parsed.
        * If list of string, then indicates list of column names to be parsed.

        .. versionadded:: 0.24.0

        * If callable, then evaluate each column name against it and parse the
          column if the callable returns ``True``.

        .. versionadded:: 0.24.0

    squeeze : bool, default False
        If the parsed data only contains one column then return a Series.
    dtype : Type name or dict of column -> type, default None
        Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32}
        Use `object` to preserve data as stored in Excel and not interpret dtype.
        If converters are specified, they will be applied INSTEAD
        of dtype conversion.

        .. versionadded:: 0.20.0

    engine : str, default None
        If io is not a buffer or path, this must be set to identify io.
        Acceptable values are None or xlrd.
    converters : dict, default None
        Dict of functions for converting values in certain columns. Keys can
        either be integers or column labels, values are functions that take one
        input argument, the Excel cell content, and return the transformed
        content.
    true_values : list, default None
        Values to consider as True.

        .. versionadded:: 0.19.0

    false_values : list, default None
        Values to consider as False.

        .. versionadded:: 0.19.0

    skiprows : list-like
        Rows to skip at the beginning (0-indexed).
    nrows : int, default None
        Number of rows to parse.

        .. versionadded:: 0.23.0

    na_values : scalar, str, list-like, or dict, default None
        Additional strings to recognize as NA/NaN. If dict passed, specific
        per-column NA values. By default the following values are interpreted
        as NaN: '', '#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan',
        '1.#IND', '1.#QNAN', 'N/A', 'NA', 'NULL', 'NaN', 'n/a', 'nan',
        'null'.
    keep_default_na : bool, default True
        If na_values are specified and keep_default_na is False the default NaN
        values are overridden, otherwise they're appended to.
    verbose : bool, default False
        Indicate number of NA values placed in non-numeric columns.
    parse_dates : bool, list-like, or dict, default False
        The behavior is as follows:

        * bool. If True -> try parsing the index.
        * list of int or names. e.g. If [1, 2, 3] -> try parsing columns 1, 2, 3
          each as a separate date column.
        * list of lists. e.g.  If [[1, 3]] -> combine columns 1 and 3 and parse as
          a single date column.
        * dict, e.g. {{'foo' : [1, 3]}} -> parse columns 1, 3 as date and call
          result 'foo'

        If a column or index contains an unparseable date, the entire column or
        index will be returned unaltered as an object data type. For non-standard
        datetime parsing, use ``pd.to_datetime`` after ``pd.read_csv``

        Note: A fast-path exists for iso8601-formatted dates.
    date_parser : function, optional
        Function to use for converting a sequence of string columns to an array of
        datetime instances. The default uses ``dateutil.parser.parser`` to do the
        conversion. Pandas will try to call `date_parser` in three different ways,
        advancing to the next if an exception occurs: 1) Pass one or more arrays
        (as defined by `parse_dates`) as arguments; 2) concatenate (row-wise) the
        string values from the columns defined by `parse_dates` into a single array
        and pass that; and 3) call `date_parser` once for each row using one or
        more strings (corresponding to the columns defined by `parse_dates`) as
        arguments.
    thousands : str, default None
        Thousands separator for parsing string columns to numeric.  Note that
        this parameter is only necessary for columns stored as TEXT in Excel,
        any numeric columns will automatically be parsed, regardless of display
        format.
    comment : str, default None
        Comments out remainder of line. Pass a character or characters to this
        argument to indicate comments in the input file. Any data between the
        comment string and the end of the current line is ignored.
    skip_footer : int, default 0
        Alias of `skipfooter`.

        .. deprecated:: 0.23.0
           Use `skipfooter` instead.
    skipfooter : int, default 0
        Rows at the end to skip (0-indexed).
    convert_float : bool, default True
        Convert integral floats to int (i.e., 1.0 --> 1). If False, all numeric
        data will be read in as floats: Excel stores all numbers as floats
        internally.
    mangle_dupe_cols : bool, default True
        Duplicate columns will be specified as 'X', 'X.1', ...'X.N', rather than
        'X'...'X'. Passing in False will cause data to be overwritten if there
        are duplicate names in the columns.
    **kwds : optional
            Optional keyword arguments can be passed to ``TextFileReader``.

    Returns
    -------
    DataFrame or dict of DataFrames
        DataFrame from the passed in Excel file. See notes in sheet_name
        argument for more information on when a dict of DataFrames is returned.

    See Also
    --------
    to_excel : Write DataFrame to an Excel file.
    to_csv : Write DataFrame to a comma-separated values (csv) file.
    read_csv : Read a comma-separated values (csv) file into DataFrame.
    read_fwf : Read a table of fixed-width formatted lines into DataFrame.

    Examples
    --------
    The file can be read using the file name as string or an open file object:

    >>> pd.read_excel('tmp.xlsx', index_col=0)  # doctest: +SKIP
           Name  Value
    0   string1      1
    1   string2      2
    2  #Comment      3

    >>> pd.read_excel(open('tmp.xlsx', 'rb'),
    ...               sheet_name='Sheet3')  # doctest: +SKIP
       Unnamed: 0      Name  Value
    0           0   string1      1
    1           1   string2      2
    2           2  #Comment      3

    Index and header can be specified via the `index_col` and `header` arguments

    >>> pd.read_excel('tmp.xlsx', index_col=None, header=None)  # doctest: +SKIP
         0         1      2
    0  NaN      Name  Value
    1  0.0   string1      1
    2  1.0   string2      2
    3  2.0  #Comment      3

    Column types are inferred but can be explicitly specified

    >>> pd.read_excel('tmp.xlsx', index_col=0,
    ...               dtype={'Name': str, 'Value': float})  # doctest: +SKIP
           Name  Value
    0   string1    1.0
    1   string2    2.0
    2  #Comment    3.0

    True, False, and NA values, and thousands separators have defaults,
    but can be explicitly specified, too. Supply the values you would like
    as strings or lists of strings!

    >>> pd.read_excel('tmp.xlsx', index_col=0,
    ...               na_values=['string1', 'string2'])  # doctest: +SKIP
           Name  Value
    0       NaN      1
    1       NaN      2
    2  #Comment      3

    Comment lines in the excel input file can be skipped using the `comment` kwarg

    >>> pd.read_excel('tmp.xlsx', index_col=0, comment='#')  # doctest: +SKIP
          Name  Value
    0  string1    1.0
    1  string2    2.0
    2     None    NaN

In [22]:
type(new_excel)

pandas.core.frame.DataFrame

In [23]:
new_excel.tail

<bound method NDFrame.tail of     Unnamed: 0                Unnamed: 1  2019-04-01 00:00:00  \
0     99007714                Amit Purty                  NaN
1     99018294             Lavanya Chapa                  NaN
2     99097931               Sunil Undar                  NaN
3     99112394              Yogesh Uppal                  NaN
4     99119422                SURAJ JAIN                  NaN
5     99111227     Jyothish Kumar Bellam                  NaN
6     99121343             Aditya Gaurav                  NaN
7     99084053         Arun Kumar Molugu                  NaN
8     99099398          Sivakumar Veluru                  NaN
9     99101824           Sathish Kumar K                  NaN
10    99116600            Pavan Kumar HS                  NaN
11    99104115          Venu Lekkalapudi                  NaN
12    99101891        Basappa Allannavar                  NaN
13      439853  Krishnaprasad Damodharan               153.00
14    99114625        Arumugam Duraisamy                  NaN
15      442223       Narender Loganathan               153.00
16    99088901        Gangamahesh Parasa                  NaN
17      436843          Arun Govindasamy               114.75
18      442998                 Prakash S               131.50
19    99101998              Bhupal Reddy                  NaN
20    99117567        Manish Kumar Rajak                  NaN
21      447490           Mahesh Yanamala               170.00
22    99101630      Sathish Kumar Namani                  NaN
23      439840            Suneetha Narni               161.50
24    99104131              Sneha Sharma                  NaN
25    99116465             Raju Sripathi                  NaN

    2019-05-01 00:00:00  2019-06-01 00:00:00  2019-07-01 00:00:00
0                301.75                 85.0               233.50
1                263.50                127.5               212.50
2                382.50                127.5               212.50
3                306.00                127.5               212.50
4                408.00                119.0               212.50
5                374.00                119.0               204.00
6                374.00                119.0               204.00
7                336.00                112.0               200.00
8                348.52                127.5               195.50
9                304.00                 88.0               192.00
10               336.00                128.0               192.00
11               299.00                120.0               177.00
12               320.00                128.0               166.00
13               147.50                143.0               163.00
14               360.00                120.0               160.00
15               178.00                124.0               153.00
16               357.00                118.9               144.50
17               101.75                140.5               136.25
18               198.50                133.5               134.00
19               352.00                 80.0               128.00
20               340.00                127.5               119.00
21               177.00                170.0               110.50
22               195.00                 66.0                82.00
23               -13.00                 98.0                78.00
24               328.00                  NaN                  NaN
25               160.00                  NaN                  NaN  >

In [24]:
new_excel.head()

,Unnamed: 0,Unnamed: 1,2019-04-01 00:00:00,2019-05-01 00:00:00,2019-06-01 00:00:00,2019-07-01 00:00:00
0,99007714,Amit Purty,NaN,301.75,85.0,233.5
1,99018294,Lavanya Chapa,NaN,263.50,127.5,212.5
2,99097931,Sunil Undar,NaN,382.50,127.5,212.5
3,99112394,Yogesh Uppal,NaN,306.00,127.5,212.5
4,99119422,SURAJ JAIN,NaN,408.00,119.0,212.5

In [26]:
new_excel.tail()

,Unnamed: 0,Unnamed: 1,2019-04-01 00:00:00,2019-05-01 00:00:00,2019-06-01 00:00:00,2019-07-01 00:00:00
21,447490,Mahesh Yanamala,170.0,177.0,170.0,110.5
22,99101630,Sathish Kumar Namani,NaN,195.0,66.0,82.0
23,439840,Suneetha Narni,161.5,-13.0,98.0,78.0
24,99104131,Sneha Sharma,NaN,328.0,NaN,NaN
25,99116465,Raju Sripathi,NaN,160.0,NaN,NaN

In [27]:
#To know the size
new_excel.shape

(26, 6)

In [28]:
#to know the datatypes of the columns
new_excel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 6 columns):
Unnamed: 0             26 non-null int64
Unnamed: 1             26 non-null object
2019-04-01 00:00:00    6 non-null float64
2019-05-01 00:00:00    26 non-null float64
2019-06-01 00:00:00    24 non-null float64
2019-07-01 00:00:00    24 non-null float64
dtypes: float64(4), int64(1), object(1)
memory usage: 1.3+ KB

In [29]:
new_excel.describe()
#Will give statistical info of the numeric columns alone. Not the other columns

,Unnamed: 0,2019-04-01 00:00:00,2019-05-01 00:00:00,2019-06-01 00:00:00,2019-07-01 00:00:00
count,2.600000e+01,6.000000,26.000000,24.000000,24.000000
mean,7.633041e+07,147.291667,278.270000,118.725000,167.593750
std,4.238923e+07,20.450194,103.399284,22.199633,43.564096
min,4.368430e+05,114.750000,-13.000000,66.000000,78.000000
25%,9.901036e+07,136.875000,195.875000,117.175000,135.687500
50%,9.910173e+07,153.000000,313.000000,122.000000,171.500000
75%,9.911210e+07,159.375000,351.130000,127.625000,204.000000
max,9.912134e+07,170.000000,408.000000,170.000000,233.500000

In [30]:
new_excel.columns
#here columns is an attribute like shape. It is not a method

Index([       'Unnamed: 0',        'Unnamed: 1', 2019-04-01 00:00:00,
       2019-05-01 00:00:00, 2019-06-01 00:00:00, 2019-07-01 00:00:00],
      dtype='object')

In [31]:
new_excel.columns.tolist()
#Column is also an attribute like shape

['Unnamed: 0',
 'Unnamed: 1',
 datetime.datetime(2019, 4, 1, 0, 0),
 datetime.datetime(2019, 5, 1, 0, 0),
 datetime.datetime(2019, 6, 1, 0, 0),
 datetime.datetime(2019, 7, 1, 0, 0)]

In [32]:
#Checking for missing values
new_excel.isnull()

,Unnamed: 0,Unnamed: 1,2019-04-01 00:00:00,2019-05-01 00:00:00,2019-06-01 00:00:00,2019-07-01 00:00:00
0,False,False,True,False,False,False
1,False,False,True,False,False,False
2,False,False,True,False,False,False
3,False,False,True,False,False,False
4,False,False,True,False,False,False
5,False,False,True,False,False,False
6,False,False,True,False,False,False
7,False,False,True,False,False,False
8,False,False,True,False,False,False
9,False,False,True,False,False,False
10,False,False,True,False,False,False
11,False,False,True,False,False,False
12,False,False,True,False,False,False
13,False,False,False,False,False,False
14,False,False,True,False,False,False
15,False,False,False,False,False,False
16,False,False,True,False,False,False
17,False,False,False,False,False,False
18,False,False,False,False,False,False
19,False,False,True,False,False,False
20,False,False,True,False,False,False
21,False,False,False,False,False,False
22,False,False,True,False,False,False
23,False,False,False,False,False,False
24,False,False,True,False,True,True
25,False,False,True,False,True,True

In [33]:
new_excel.isnull().sum()
#this is what is normally used to identify nulls as it gives the count of nulls column-wise

Unnamed: 0              0
Unnamed: 1              0
2019-04-01 00:00:00    20
2019-05-01 00:00:00     0
2019-06-01 00:00:00     2
2019-07-01 00:00:00     2
dtype: int64

In [36]:
#list1=[True,False,True]
list1 = pd.Series([True,False,True])

In [143]:
list1.sum()

2

In [97]:
#to find the rows whwere we have null values. The above is for columns
new_excel[new_excel.isnull().any(axis=1)]

,EMPID,Name,April Month,May Month,June Month,July Month
0,99007714,Amit Purty,NaN,301.75,85.0,233.5
1,99018294,Lavanya Chapa,NaN,263.50,127.5,212.5
2,99097931,Sunil Undar,NaN,382.50,127.5,212.5
3,99112394,Yogesh Uppal,NaN,306.00,127.5,212.5
4,99119422,SURAJ JAIN,NaN,408.00,119.0,212.5
5,99111227,Jyothish Kumar Bellam,NaN,374.00,119.0,204.0
6,99121343,Aditya Gaurav,NaN,374.00,119.0,204.0
7,99084053,Arun Kumar Molugu,NaN,336.00,112.0,200.0
8,99099398,Sivakumar Veluru,NaN,348.52,127.5,195.5
9,99101824,Sathish Kumar K,NaN,304.00,88.0,192.0
10,99116600,Pavan Kumar HS,NaN,336.00,128.0,192.0
11,99104115,Venu Lekkalapudi,NaN,299.00,120.0,177.0
12,99101891,Basappa Allannavar,NaN,320.00,128.0,166.0
14,99114625,Arumugam Duraisamy,NaN,360.00,120.0,160.0
16,99088901,Gangamahesh Parasa,NaN,357.00,118.9,144.5
19,99101998,Bhupal Reddy,NaN,352.00,80.0,128.0
20,99117567,Manish Kumar Rajak,NaN,340.00,127.5,119.0
22,99101630,Sathish Kumar Namani,NaN,195.00,66.0,82.0
24,99104131,Sneha Sharma,NaN,328.00,NaN,NaN
25,99116465,Raju Sripathi,NaN,160.00,NaN,NaN

In [40]:
#If i want to get one column
new_excel['2019-04-01 00:00:00']

KeyError: '2019-04-01 00:00:00'

In [101]:
#To get more than one columns will have to pass both the column in a list
#olympic_data[["city",'sport']].head()
# only for one column olympic_data.city
#new_excel.info()
olympic_data.head()
olympic_data[["City","Sport"]].head()
olympic_data.City

0         Athens
1         Athens
2         Athens
3            NaN
4         Athens
5         Athens
6         Athens
7         Athens
8         Athens
9         Athens
10        Athens
11        Athens
12        Athens
13        Athens
14        Athens
15        Athens
16        Athens
17        Athens
18        Athens
19        Athens
20        Athens
21        Athens
22        Athens
23        Athens
24        Athens
25        Athens
26        Athens
27        Athens
28        Athens
29        Athens
          ...
29187    Beijing
29188    Beijing
29189    Beijing
29190    Beijing
29191    Beijing
29192    Beijing
29193    Beijing
29194    Beijing
29195    Beijing
29196    Beijing
29197    Beijing
29198    Beijing
29199    Beijing
29200    Beijing
29201    Beijing
29202    Beijing
29203    Beijing
29204    Beijing
29205    Beijing
29206    Beijing
29207    Beijing
29208    Beijing
29209    Beijing
29210    Beijing
29211    Beijing
29212    Beijing
29213    Beijing
29214    Beijing
29215    Beijing
29216    Beijing
Name: City, Length: 29217, dtype: object

In [43]:
new_excel = pd.read_excel("C:/Users/tin2419/Desktop/Time Report.xlsx")

In [44]:
new_excel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 6 columns):
EMPID    26 non-null int64
Name     26 non-null object
Col1     6 non-null float64
Col2     26 non-null float64
Col3     24 non-null float64
Col4     24 non-null float64
dtypes: float64(4), int64(1), object(1)
memory usage: 1.3+ KB

In [45]:
new_excel.EMPID.head()

0    99007714
1    99018294
2    99097931
3    99112394
4    99119422
Name: EMPID, dtype: int64

In [60]:
#new_excel[new_excel["Col2"]==301.75]
#new_excel[(new_excel["Col2"]==301.75) | (new_excel["Col3"]==127.5)]
new_excel[(new_excel["Col2"]==382.5) & (new_excel["Col3"]==127.5)]
#The first one is for 'OR' and the second for 'AND'

      EMPID         Name  Col1   Col2   Col3   Col4
2  99097931  Sunil Undar   NaN  382.5  127.5  212.5

In [61]:
new_excel[(new_excel["Col2"]==301.75) | (new_excel["Col3"]==127.5)].shape

(6, 6)

In [62]:
new_excel[(new_excel["Col2"]==301.75) | (new_excel["Col3"]==127.5)].shape[0]

6

In [63]:
new_excel.isnull().any(axis=1)
#How many values in the colums are null. it returns even if one column is null. It goes row wise. So for each row it will 
#tell us if any of the column is null

0      True
1      True
2      True
3      True
4      True
5      True
6      True
7      True
8      True
9      True
10     True
11     True
12     True
13    False
14     True
15    False
16     True
17    False
18    False
19     True
20     True
21    False
22     True
23    False
24     True
25     True
dtype: bool

In [64]:
new_excel[new_excel.isnull().any(axis=1)]
#here axis = 1, it says that check the columns in each row

       EMPID                   Name  Col1    Col2   Col3   Col4
0   99007714             Amit Purty   NaN  301.75   85.0  233.5
1   99018294          Lavanya Chapa   NaN  263.50  127.5  212.5
2   99097931            Sunil Undar   NaN  382.50  127.5  212.5
3   99112394           Yogesh Uppal   NaN  306.00  127.5  212.5
4   99119422             SURAJ JAIN   NaN  408.00  119.0  212.5
5   99111227  Jyothish Kumar Bellam   NaN  374.00  119.0  204.0
6   99121343          Aditya Gaurav   NaN  374.00  119.0  204.0
7   99084053      Arun Kumar Molugu   NaN  336.00  112.0  200.0
8   99099398       Sivakumar Veluru   NaN  348.52  127.5  195.5
9   99101824        Sathish Kumar K   NaN  304.00   88.0  192.0
10  99116600         Pavan Kumar HS   NaN  336.00  128.0  192.0
11  99104115       Venu Lekkalapudi   NaN  299.00  120.0  177.0
12  99101891     Basappa Allannavar   NaN  320.00  128.0  166.0
14  99114625     Arumugam Duraisamy   NaN  360.00  120.0  160.0
16  99088901     Gangamahesh Parasa   NaN  357.00  118.9  144.5
19  99101998           Bhupal Reddy   NaN  352.00   80.0  128.0
20  99117567     Manish Kumar Rajak   NaN  340.00  127.5  119.0
22  99101630   Sathish Kumar Namani   NaN  195.00   66.0   82.0
24  99104131           Sneha Sharma   NaN  328.00    NaN    NaN
25  99116465          Raju Sripathi   NaN  160.00    NaN    NaN

In [65]:
new_excel[new_excel.isnull().all(axis=1)]
#To find rows where all the values are null
#For this we will never use axis = 0, because we are always checking the columns in the rows

Empty DataFrame
Columns: [EMPID, Name, Col1, Col2, Col3, Col4]
Index: []

In [66]:
#Where we need to use axis = 0
#To drop rows that have null values
#new_excel.dropna(how="any",axis=0)
new_excel = pd.read_excel("C:/Users/tin2419/Desktop/Time Report.xlsx")

In [67]:
new_excel.dropna(how="any",axis=0)

     EMPID                      Name    Col1    Col2   Col3    Col4
13  439853  Krishnaprasad Damodharan  153.00  147.50  143.0  163.00
15  442223       Narender Loganathan  153.00  178.00  124.0  153.00
17  436843          Arun Govindasamy  114.75  101.75  140.5  136.25
18  442998                 Prakash S  131.50  198.50  133.5  134.00
21  447490           Mahesh Yanamala  170.00  177.00  170.0  110.50
23  439840            Suneetha Narni  161.50  -13.00   98.0   78.00

In [68]:
new_excel.dropna(how="all",axis=0)

       EMPID                      Name    Col1    Col2   Col3    Col4
0   99007714                Amit Purty     NaN  301.75   85.0  233.50
1   99018294             Lavanya Chapa     NaN  263.50  127.5  212.50
2   99097931               Sunil Undar     NaN  382.50  127.5  212.50
3   99112394              Yogesh Uppal     NaN  306.00  127.5  212.50
4   99119422                SURAJ JAIN     NaN  408.00  119.0  212.50
5   99111227     Jyothish Kumar Bellam     NaN  374.00  119.0  204.00
6   99121343             Aditya Gaurav     NaN  374.00  119.0  204.00
7   99084053         Arun Kumar Molugu     NaN  336.00  112.0  200.00
8   99099398          Sivakumar Veluru     NaN  348.52  127.5  195.50
9   99101824           Sathish Kumar K     NaN  304.00   88.0  192.00
10  99116600            Pavan Kumar HS     NaN  336.00  128.0  192.00
11  99104115          Venu Lekkalapudi     NaN  299.00  120.0  177.00
12  99101891        Basappa Allannavar     NaN  320.00  128.0  166.00
13    439853  Krishnaprasad Damodharan  153.00  147.50  143.0  163.00
14  99114625        Arumugam Duraisamy     NaN  360.00  120.0  160.00
15    442223       Narender Loganathan  153.00  178.00  124.0  153.00
16  99088901        Gangamahesh Parasa     NaN  357.00  118.9  144.50
17    436843          Arun Govindasamy  114.75  101.75  140.5  136.25
18    442998                 Prakash S  131.50  198.50  133.5  134.00
19  99101998              Bhupal Reddy     NaN  352.00   80.0  128.00
20  99117567        Manish Kumar Rajak     NaN  340.00  127.5  119.00
21    447490           Mahesh Yanamala  170.00  177.00  170.0  110.50
22  99101630      Sathish Kumar Namani     NaN  195.00   66.0   82.00
23    439840            Suneetha Narni  161.50  -13.00   98.0   78.00
24  99104131              Sneha Sharma     NaN  328.00    NaN     NaN
25  99116465             Raju Sripathi     NaN  160.00    NaN     NaN
26  99116466                    Rajesh     NaN     NaN    NaN     NaN

In [69]:
new_excel_drop = new_excel.dropna(how="all",axis=0,inplace=True)
#Once we drop it using inplace, then no point assigning it. So the above statement is useless

In [72]:
new_excel_drop
#will give us nothing

In [73]:
help(new_excel.dropna)
# Remember to use the object name

Help on method dropna in module pandas.core.frame:

dropna(axis=0, how='any', thresh=None, subset=None, inplace=False) method of pandas.core.frame.DataFrame instance
    Remove missing values.

    See the :ref:`User Guide <missing_data>` for more on which values are
    considered missing, and how to work with missing data.

    Parameters
    ----------
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Determine if rows or columns which contain missing values are
        removed.

        * 0, or 'index' : Drop rows which contain missing values.
        * 1, or 'columns' : Drop columns which contain missing value.

        .. deprecated:: 0.23.0

           Pass tuple or list to drop on multiple axes.
           Only a single axis is allowed.

    how : {'any', 'all'}, default 'any'
        Determine if row or column is removed from DataFrame, when we have
        at least one NA or all NA.

        * 'any' : If any NA values are present, drop that row or column.
        * 'all' : If all values are NA, drop that row or column.

    thresh : int, optional
        Require that many non-NA values.
    subset : array-like, optional
        Labels along other axis to consider, e.g. if you are dropping rows
        these would be a list of columns to include.
    inplace : bool, default False
        If True, do operation inplace and return None.

    Returns
    -------
    DataFrame
        DataFrame with NA entries dropped from it.

    See Also
    --------
    DataFrame.isna: Indicate missing values.
    DataFrame.notna : Indicate existing (non-missing) values.
    DataFrame.fillna : Replace missing values.
    Series.dropna : Drop missing values.
    Index.dropna : Drop missing indices.

    Examples
    --------
    >>> df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
    ...                    "toy": [np.nan, 'Batmobile', 'Bullwhip'],
    ...                    "born": [pd.NaT, pd.Timestamp("1940-04-25"),
    ...                             pd.NaT]})
    >>> df
           name        toy       born
    0    Alfred        NaN        NaT
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Drop the rows where at least one element is missing.

    >>> df.dropna()
         name        toy       born
    1  Batman  Batmobile 1940-04-25

    Drop the columns where at least one element is missing.

    >>> df.dropna(axis='columns')
           name
    0    Alfred
    1    Batman
    2  Catwoman

    Drop the rows where all elements are missing.

    >>> df.dropna(how='all')
           name        toy       born
    0    Alfred        NaN        NaT
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Keep only the rows with at least 2 non-NA values.

    >>> df.dropna(thresh=2)
           name        toy       born
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Define in which columns to look for missing values.

    >>> df.dropna(subset=['name', 'born'])
           name        toy       born
    1    Batman  Batmobile 1940-04-25

    Keep the DataFrame with valid entries in the same variable.

    >>> df.dropna(inplace=True)
    >>> df
         name        toy       born
    1  Batman  Batmobile 1940-04-25

In [74]:
new_excel = pd.read_excel("C:/Users/tin2419/Desktop/Time Report.xlsx")

In [77]:
new_excel_drop = new_excel.dropna(how="any",axis=0)

In [78]:
new_excel_drop

     EMPID                      Name    Col1    Col2   Col3    Col4
13  439853  Krishnaprasad Damodharan  153.00  147.50  143.0  163.00
15  442223       Narender Loganathan  153.00  178.00  124.0  153.00
17  436843          Arun Govindasamy  114.75  101.75  140.5  136.25
18  442998                 Prakash S  131.50  198.50  133.5  134.00
21  447490           Mahesh Yanamala  170.00  177.00  170.0  110.50
23  439840            Suneetha Narni  161.50  -13.00   98.0   78.00

In [79]:
new_excel = new_excel.dropna(how="any",axis=1).shape

In [80]:
new_excel = new_excel.dropna(how="any",axis=1)
#here axis =1 means drop the column. please make note. axis means what you want to drop - here it is column
#the other one was how we want to search - this has the opposite meaning.

AttributeError: 'tuple' object has no attribute 'dropna'

In [82]:
#If i want to fill the null values 
new_excel[new_excel.isnull().any(axis=1)]

AttributeError: 'tuple' object has no attribute 'isnull'

In [83]:
new_excel.head()

AttributeError: 'tuple' object has no attribute 'head'

In [116]:
#new_excel = pd.read_excel("C:/Users/tin2419/Desktop/DSFiles/timereport.xlsx", skiprows=3)
#new_excel.head()
#new_excel["Name"].fillna("Sunil").head()
#Fill using sunil wherever it is null
#new_excel.fillna({"Name":"No Name","April Month":"No Value"})
#In the Name column replace nulls with No Name and in the April Month column, replace nulls with No Value
#import numpy as np
new_excel["May Month"].fillna(np.mode())
#using numpy function (np). Wherever in the city column, one finds null, fill it using the mode value - np.mode()

AttributeError: module 'numpy' has no attribute 'mode'

In [85]:
new_excel["Name"].fillna("Amit Purty").head()

0       Amit Purty
1    Lavanya Chapa
2      Sunil Undar
3     Yogesh Uppal
4       SURAJ JAIN
Name: Name, dtype: object

In [86]:
new_excel.head()

      EMPID           Name  Col1    Col2   Col3   Col4
0  99007714     Amit Purty   NaN  301.75   85.0  233.5
1  99018294  Lavanya Chapa   NaN  263.50  127.5  212.5
2  99097931    Sunil Undar   NaN  382.50  127.5  212.5
3  99112394   Yogesh Uppal   NaN  306.00  127.5  212.5
4  99119422     SURAJ JAIN   NaN  408.00  119.0  212.5

In [87]:
new_excel.tail()

       EMPID                  Name   Col1   Col2  Col3  Col4
22  99101630  Sathish Kumar Namani    NaN  195.0  66.0  82.0
23    439840        Suneetha Narni  161.5  -13.0  98.0  78.0
24  99104131          Sneha Sharma    NaN  328.0   NaN   NaN
25  99116465         Raju Sripathi    NaN  160.0   NaN   NaN
26  99116466                Rajesh    NaN    NaN   NaN   NaN

In [88]:
#loc - label based access (column based access) and iloc - integer based access  (row based access)
new_excel = pd.read_excel("C:/Users/tin2419/Desktop/Time Report.xlsx",index_col ="Name")

In [89]:
# the index is changed to name and now the Name column is no longer part of the data
new_excel.head()

                  EMPID  Col1    Col2   Col3   Col4
Name
Amit Purty     99007714   NaN  301.75   85.0  233.5
Lavanya Chapa  99018294   NaN  263.50  127.5  212.5
Sunil Undar    99097931   NaN  382.50  127.5  212.5
Yogesh Uppal   99112394   NaN  306.00  127.5  212.5
SURAJ JAIN     99119422   NaN  408.00  119.0  212.5

In [90]:
#To change index back. Now name is no longer part of the index
new_excel.reset_index()

                        Name     EMPID    Col1    Col2   Col3    Col4
0                 Amit Purty  99007714     NaN  301.75   85.0  233.50
1              Lavanya Chapa  99018294     NaN  263.50  127.5  212.50
2                Sunil Undar  99097931     NaN  382.50  127.5  212.50
3               Yogesh Uppal  99112394     NaN  306.00  127.5  212.50
4                 SURAJ JAIN  99119422     NaN  408.00  119.0  212.50
5      Jyothish Kumar Bellam  99111227     NaN  374.00  119.0  204.00
6              Aditya Gaurav  99121343     NaN  374.00  119.0  204.00
7          Arun Kumar Molugu  99084053     NaN  336.00  112.0  200.00
8           Sivakumar Veluru  99099398     NaN  348.52  127.5  195.50
9            Sathish Kumar K  99101824     NaN  304.00   88.0  192.00
10            Pavan Kumar HS  99116600     NaN  336.00  128.0  192.00
11          Venu Lekkalapudi  99104115     NaN  299.00  120.0  177.00
12        Basappa Allannavar  99101891     NaN  320.00  128.0  166.00
13  Krishnaprasad Damodharan    439853  153.00  147.50  143.0  163.00
14        Arumugam Duraisamy  99114625     NaN  360.00  120.0  160.00
15       Narender Loganathan    442223  153.00  178.00  124.0  153.00
16        Gangamahesh Parasa  99088901     NaN  357.00  118.9  144.50
17          Arun Govindasamy    436843  114.75  101.75  140.5  136.25
18                 Prakash S    442998  131.50  198.50  133.5  134.00
19              Bhupal Reddy  99101998     NaN  352.00   80.0  128.00
20        Manish Kumar Rajak  99117567     NaN  340.00  127.5  119.00
21           Mahesh Yanamala    447490  170.00  177.00  170.0  110.50
22      Sathish Kumar Namani  99101630     NaN  195.00   66.0   82.00
23            Suneetha Narni    439840  161.50  -13.00   98.0   78.00
24              Sneha Sharma  99104131     NaN  328.00    NaN     NaN
25             Raju Sripathi  99116465     NaN  160.00    NaN     NaN
26                    Rajesh  99116466     NaN     NaN    NaN     NaN

In [91]:
new_excel

                             EMPID    Col1    Col2   Col3    Col4
Name
Amit Purty                99007714     NaN  301.75   85.0  233.50
Lavanya Chapa             99018294     NaN  263.50  127.5  212.50
Sunil Undar               99097931     NaN  382.50  127.5  212.50
Yogesh Uppal              99112394     NaN  306.00  127.5  212.50
SURAJ JAIN                99119422     NaN  408.00  119.0  212.50
Jyothish Kumar Bellam     99111227     NaN  374.00  119.0  204.00
Aditya Gaurav             99121343     NaN  374.00  119.0  204.00
Arun Kumar Molugu         99084053     NaN  336.00  112.0  200.00
Sivakumar Veluru          99099398     NaN  348.52  127.5  195.50
Sathish Kumar K           99101824     NaN  304.00   88.0  192.00
Pavan Kumar HS            99116600     NaN  336.00  128.0  192.00
Venu Lekkalapudi          99104115     NaN  299.00  120.0  177.00
Basappa Allannavar        99101891     NaN  320.00  128.0  166.00
Krishnaprasad Damodharan    439853  153.00  147.50  143.0  163.00
Arumugam Duraisamy        99114625     NaN  360.00  120.0  160.00
Narender Loganathan         442223  153.00  178.00  124.0  153.00
Gangamahesh Parasa        99088901     NaN  357.00  118.9  144.50
Arun Govindasamy            436843  114.75  101.75  140.5  136.25
Prakash S                   442998  131.50  198.50  133.5  134.00
Bhupal Reddy              99101998     NaN  352.00   80.0  128.00
Manish Kumar Rajak        99117567     NaN  340.00  127.5  119.00
Mahesh Yanamala             447490  170.00  177.00  170.0  110.50
Sathish Kumar Namani      99101630     NaN  195.00   66.0   82.00
Suneetha Narni              439840  161.50  -13.00   98.0   78.00
Sneha Sharma              99104131     NaN  328.00    NaN     NaN
Raju Sripathi             99116465     NaN  160.00    NaN     NaN
Rajesh                    99116466     NaN     NaN    NaN     NaN

In [92]:
new_excel.reset_index(inplace = True)

In [93]:
#ONly now changes will be confirmed
new_excel

                        Name     EMPID    Col1    Col2   Col3    Col4
0                 Amit Purty  99007714     NaN  301.75   85.0  233.50
1              Lavanya Chapa  99018294     NaN  263.50  127.5  212.50
2                Sunil Undar  99097931     NaN  382.50  127.5  212.50
3               Yogesh Uppal  99112394     NaN  306.00  127.5  212.50
4                 SURAJ JAIN  99119422     NaN  408.00  119.0  212.50
5      Jyothish Kumar Bellam  99111227     NaN  374.00  119.0  204.00
6              Aditya Gaurav  99121343     NaN  374.00  119.0  204.00
7          Arun Kumar Molugu  99084053     NaN  336.00  112.0  200.00
8           Sivakumar Veluru  99099398     NaN  348.52  127.5  195.50
9            Sathish Kumar K  99101824     NaN  304.00   88.0  192.00
10            Pavan Kumar HS  99116600     NaN  336.00  128.0  192.00
11          Venu Lekkalapudi  99104115     NaN  299.00  120.0  177.00
12        Basappa Allannavar  99101891     NaN  320.00  128.0  166.00
13  Krishnaprasad Damodharan    439853  153.00  147.50  143.0  163.00
14        Arumugam Duraisamy  99114625     NaN  360.00  120.0  160.00
15       Narender Loganathan    442223  153.00  178.00  124.0  153.00
16        Gangamahesh Parasa  99088901     NaN  357.00  118.9  144.50
17          Arun Govindasamy    436843  114.75  101.75  140.5  136.25
18                 Prakash S    442998  131.50  198.50  133.5  134.00
19              Bhupal Reddy  99101998     NaN  352.00   80.0  128.00
20        Manish Kumar Rajak  99117567     NaN  340.00  127.5  119.00
21           Mahesh Yanamala    447490  170.00  177.00  170.0  110.50
22      Sathish Kumar Namani  99101630     NaN  195.00   66.0   82.00
23            Suneetha Narni    439840  161.50  -13.00   98.0   78.00
24              Sneha Sharma  99104131     NaN  328.00    NaN     NaN
25             Raju Sripathi  99116465     NaN  160.00    NaN     NaN
26                    Rajesh  99116466     NaN     NaN    NaN     NaN

In [94]:
new_excel.set_index("EMPID")

                              Name    Col1    Col2   Col3    Col4
EMPID
99007714                Amit Purty     NaN  301.75   85.0  233.50
99018294             Lavanya Chapa     NaN  263.50  127.5  212.50
99097931               Sunil Undar     NaN  382.50  127.5  212.50
99112394              Yogesh Uppal     NaN  306.00  127.5  212.50
99119422                SURAJ JAIN     NaN  408.00  119.0  212.50
99111227     Jyothish Kumar Bellam     NaN  374.00  119.0  204.00
99121343             Aditya Gaurav     NaN  374.00  119.0  204.00
99084053         Arun Kumar Molugu     NaN  336.00  112.0  200.00
99099398          Sivakumar Veluru     NaN  348.52  127.5  195.50
99101824           Sathish Kumar K     NaN  304.00   88.0  192.00
99116600            Pavan Kumar HS     NaN  336.00  128.0  192.00
99104115          Venu Lekkalapudi     NaN  299.00  120.0  177.00
99101891        Basappa Allannavar     NaN  320.00  128.0  166.00
439853    Krishnaprasad Damodharan  153.00  147.50  143.0  163.00
99114625        Arumugam Duraisamy     NaN  360.00  120.0  160.00
442223         Narender Loganathan  153.00  178.00  124.0  153.00
99088901        Gangamahesh Parasa     NaN  357.00  118.9  144.50
436843            Arun Govindasamy  114.75  101.75  140.5  136.25
442998                   Prakash S  131.50  198.50  133.5  134.00
99101998              Bhupal Reddy     NaN  352.00   80.0  128.00
99117567        Manish Kumar Rajak     NaN  340.00  127.5  119.00
447490             Mahesh Yanamala  170.00  177.00  170.0  110.50
99101630      Sathish Kumar Namani     NaN  195.00   66.0   82.00
439840              Suneetha Narni  161.50  -13.00   98.0   78.00
99104131              Sneha Sharma     NaN  328.00    NaN     NaN
99116465             Raju Sripathi     NaN  160.00    NaN     NaN
99116466                    Rajesh     NaN     NaN    NaN     NaN

In [96]:
new_excel.set_index("EMPID").columns
#if you see EMPID is no longer in the column list. This is what we mean by removing it from the columns or data

Index(['Name', 'Col1', 'Col2', 'Col3', 'Col4'], dtype='object')

In [102]:
new_excel.set_index("Name").columns
#new_excel.loc['99007714']

Index(['EMPID', 'Col1', 'Col2', 'Col3', 'Col4'], dtype='object')

In [104]:
#new_excel.loc['Amit Purty']
new_excel.head()

            Name     EMPID  Col1    Col2   Col3   Col4
0     Amit Purty  99007714   NaN  301.75   85.0  233.5
1  Lavanya Chapa  99018294   NaN  263.50  127.5  212.5
2    Sunil Undar  99097931   NaN  382.50  127.5  212.5
3   Yogesh Uppal  99112394   NaN  306.00  127.5  212.5
4     SURAJ JAIN  99119422   NaN  408.00  119.0  212.5

In [105]:
new_excel.reset_index(inplace = True)

In [106]:
new_excel.head()

   index           Name     EMPID  Col1    Col2   Col3   Col4
0      0     Amit Purty  99007714   NaN  301.75   85.0  233.5
1      1  Lavanya Chapa  99018294   NaN  263.50  127.5  212.5
2      2    Sunil Undar  99097931   NaN  382.50  127.5  212.5
3      3   Yogesh Uppal  99112394   NaN  306.00  127.5  212.5
4      4     SURAJ JAIN  99119422   NaN  408.00  119.0  212.5

In [107]:
new_excel.loc[0:5]

   index                   Name     EMPID  Col1    Col2   Col3   Col4
0      0             Amit Purty  99007714   NaN  301.75   85.0  233.5
1      1          Lavanya Chapa  99018294   NaN  263.50  127.5  212.5
2      2            Sunil Undar  99097931   NaN  382.50  127.5  212.5
3      3           Yogesh Uppal  99112394   NaN  306.00  127.5  212.5
4      4             SURAJ JAIN  99119422   NaN  408.00  119.0  212.5
5      5  Jyothish Kumar Bellam  99111227   NaN  374.00  119.0  204.0

In [108]:
#loc[rowlabel:columnlabel]
new_excel.loc[5,"Name"]
#Intersection of row 5 and column 'Name' which is Jyothish

'Jyothish Kumar Bellam'

In [109]:
new_excel.loc[2:5,["Name","Col1"]]
#Whenever passing more than one column put it in []- pass as list

                    Name  Col1
2            Sunil Undar   NaN
3           Yogesh Uppal   NaN
4             SURAJ JAIN   NaN
5  Jyothish Kumar Bellam   NaN

In [110]:
new_excel.loc[2:5,"Name":"Col3"].head()
# This is a label based search and which is why all values are included unlike index based search. We don't need list here as
#it is a range

                    Name     EMPID  Col1   Col2   Col3
2            Sunil Undar  99097931   NaN  382.5  127.5
3           Yogesh Uppal  99112394   NaN  306.0  127.5
4             SURAJ JAIN  99119422   NaN  408.0  119.0
5  Jyothish Kumar Bellam  99111227   NaN  374.0  119.0

In [112]:
new_excel.loc[[2,3,5],["Name","Col3"]].head()
#if we want 2,3 and 5 separately

                    Name   Col3
2            Sunil Undar  127.5
3           Yogesh Uppal  127.5
5  Jyothish Kumar Bellam  119.0

In [114]:
new_excel.loc[:,["Name","Col1"]].head()
#Get me all the rows for Name and Col1. This is another way to get all the rows

            Name  Col1
0     Amit Purty   NaN
1  Lavanya Chapa   NaN
2    Sunil Undar   NaN
3   Yogesh Uppal   NaN
4     SURAJ JAIN   NaN

In [115]:
new_excel.loc[:,:].head()
#to get all columns and all rows

   index           Name     EMPID  Col1    Col2   Col3   Col4
0      0     Amit Purty  99007714   NaN  301.75   85.0  233.5
1      1  Lavanya Chapa  99018294   NaN  263.50  127.5  212.5
2      2    Sunil Undar  99097931   NaN  382.50  127.5  212.5
3      3   Yogesh Uppal  99112394   NaN  306.00  127.5  212.5
4      4     SURAJ JAIN  99119422   NaN  408.00  119.0  212.5

In [116]:
#To access based on position (not based on label)
new_excel.iloc[1:3,:].head()
#since this is position based, it will exclude 3 index, print 0,1 and 2 and all columns

   index           Name     EMPID  Col1   Col2   Col3   Col4
1      1  Lavanya Chapa  99018294   NaN  263.5  127.5  212.5
2      2    Sunil Undar  99097931   NaN  382.5  127.5  212.5

In [118]:
new_excel.iloc[0:2,0:1]
#Gives for the first two rows the first column (0 and 1) and one column (index 0). In iloc, we have to get integer position

   index
0      0
1      1

In [118]:
#Q1 Read the csv file
bike_sharing_orig = pd.read_csv("C:/Users/tin2419/Desktop/DSFiles/bike_sharing_python.csv")

In [119]:
#Q2 Print the data types
bike_sharing_orig.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed
0,1/20/2011 0:00,1.0,0.0,1.0,1.0,10.66,11.365,56.0,26.0027
1,1/20/2011 1:00,1.0,0.0,1.0,1.0,10.66,13.635,56.0,0.0000
2,1/20/2011 2:00,1.0,0.0,1.0,1.0,10.66,13.635,56.0,0.0000
3,1/20/2011 3:00,1.0,0.0,1.0,1.0,10.66,12.880,56.0,11.0014
4,1/20/2011 4:00,1.0,0.0,1.0,1.0,10.66,12.880,56.0,11.0014

In [172]:
bike_sharing = bike_sharing_orig

In [173]:
#Q3 Check for null values
bike_sharing.isnull().sum()

datetime      1
season        4
holiday       2
workingday    3
weather       3
temp          3
atemp         3
humidity      2
windspeed     2
dtype: int64

In [126]:
#Q4 All the rows where season = 1and holiday = 0
bike_sharing[(bike_sharing["season"]==1)&(bike_sharing["holiday"]==0)]

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed
0,1/20/2011 0:00,1.0,0.0,1.0,1.0,10.66,11.365,56.0,26.0027
1,1/20/2011 1:00,1.0,0.0,1.0,1.0,10.66,13.635,56.0,0.0000
2,1/20/2011 2:00,1.0,0.0,1.0,1.0,10.66,13.635,56.0,0.0000
3,1/20/2011 3:00,1.0,0.0,1.0,1.0,10.66,12.880,56.0,11.0014
4,1/20/2011 4:00,1.0,0.0,1.0,1.0,10.66,12.880,56.0,11.0014
5,1/20/2011 5:00,1.0,0.0,1.0,1.0,9.84,11.365,60.0,15.0013
6,1/20/2011 6:00,1.0,0.0,1.0,1.0,9.02,10.605,60.0,15.0013
7,1/20/2011 7:00,1.0,0.0,1.0,1.0,9.02,10.605,55.0,15.0013
8,1/20/2011 8:00,1.0,0.0,1.0,1.0,9.02,10.605,55.0,19.0012
9,1/20/2011 9:00,1.0,0.0,1.0,2.0,9.84,11.365,52.0,15.0013
10,1/20/2011 10:00,1.0,0.0,1.0,1.0,10.66,11.365,48.0,19.9995
11,1/20/2011 11:00,1.0,0.0,1.0,2.0,11.48,13.635,45.0,11.0014
12,1/20/2011 12:00,1.0,0.0,1.0,2.0,12.30,16.665,42.0,0.0000
13,1/20/2011 13:00,1.0,0.0,1.0,2.0,11.48,14.395,45.0,7.0015
14,1/20/2011 14:00,1.0,0.0,1.0,2.0,12.30,15.150,45.0,8.9981
15,1/20/2011 15:00,1.0,0.0,1.0,2.0,13.12,15.910,45.0,12.9980
16,1/20/2011 16:00,1.0,0.0,1.0,2.0,12.30,15.150,49.0,8.9981
17,1/20/2011 17:00,1.0,0.0,1.0,2.0,12.30,15.910,49.0,7.0015
18,1/20/2011 18:00,1.0,0.0,1.0,2.0,10.66,12.880,56.0,12.9980
19,1/20/2011 19:00,1.0,0.0,1.0,1.0,10.66,11.365,56.0,22.0028
20,1/20/2011 20:00,1.0,0.0,1.0,2.0,10.66,12.120,60.0,19.0012
21,1/20/2011 21:00,1.0,0.0,1.0,2.0,9.84,11.365,60.0,16.9979
23,1/20/2011 23:00,1.0,0.0,1.0,2.0,9.84,10.605,65.0,22.0028
24,1/21/2011 0:00,1.0,0.0,1.0,2.0,9.84,11.365,70.0,16.9979
25,1/21/2011 1:00,1.0,0.0,1.0,2.0,9.84,11.365,70.0,16.9979
26,1/21/2011 2:00,1.0,0.0,1.0,3.0,9.84,12.120,75.0,11.0014
27,1/21/2011 3:00,1.0,0.0,1.0,3.0,9.02,10.605,80.0,19.9995
28,1/21/2011 4:00,1.0,0.0,1.0,2.0,9.02,12.880,87.0,6.0032
29,1/21/2011 5:00,1.0,0.0,1.0,1.0,9.84,9.850,60.0,27.9993
30,1/21/2011 6:00,1.0,0.0,1.0,1.0,9.02,10.605,55.0,16.9979
...,...,...,...,...,...,...,...,...,...
6463,12/30/2012 18:00,1.0,0.0,0.0,2.0,9.84,10.605,44.0,19.9995
6464,12/30/2012 19:00,1.0,0.0,0.0,1.0,13.94,18.180,61.0,0.0000
6465,12/30/2012 20:00,1.0,0.0,0.0,1.0,9.02,9.850,47.0,22.0028
6466,12/30/2012 21:00,1.0,0.0,0.0,1.0,8.20,10.605,51.0,11.0014
6467,12/30/2012 22:00,1.0,0.0,0.0,1.0,8.20,9.850,55.0,12.9980
6468,12/30/2012 23:00,1.0,0.0,0.0,1.0,8.20,9.850,51.0,15.0013
6469,12/31/2012 0:00,1.0,0.0,1.0,1.0,7.38,9.090,55.0,12.9980
6470,12/31/2012 1:00,1.0,0.0,1.0,1.0,7.38,9.090,55.0,12.9980
6471,12/31/2012 2:00,1.0,0.0,1.0,1.0,6.56,8.335,59.0,11.0014
6472,12/31/2012 3:00,1.0,0.0,1.0,1.0,6.56,9.090,59.0,7.0015
6473,12/31/2012 4:00,1.0,0.0,1.0,1.0,5.74,8.335,69.0,7.0015
6474,12/31/2012 5:00,1.0,0.0,1.0,1.0,6.56,7.575,64.0,12.9980
6475,12/31/2012 6:00,1.0,0.0,1.0,1.0,6.56,8.335,64.0,11.0014
6476,12/31/2012 7:00,1.0,0.0,1.0,1.0,6.56,9.090,64.0,8.9981
6477,12/31/2012 8:00,1.0,0.0,1.0,1.0,5.74,7.575,69.0,8.9981
6478,12/31/2012 9:00,1.0,0.0,1.0,2.0,7.38,10.605,64.0,7.0015
6479,12/31/2012 10:00,1.0,0.0,1.0,2.0,8.20,10.605,69.0,8.9981
6480,12/31/2012 11:00,1.0,0.0,1.0,2.0,9.02,11.365,60.0,12.9980
6481,12/31/2012 12:00,1.0,0.0,1.0,2.0,9.84,11.365,56.0,12.9980
6482,12/31/2012 13:00,1.0,0.0,1.0,2.0,10.66,12.880,44.0,11.0014
6483,12/31/2012 14:00,1.0,0.0,1.0,2.0,11.48,13.635,45.0,15.0013
6484,12/31/2012 15:00,1.0,0.0,1.0,2.0,11.48,14.395,45.0,8.9981
6485,12/31/2012 16:00,1.0,0.0,1.0,2.0,10.66,12.880,48.0,12.9980
6486,12/31/2012 17:00,1.0,0.0,1.0,2.0,10.66,14.395,48.0,6.0032
6487,12/31/2012 18:00,1.0,0.0,1.0,2.0,10.66,13.635,48.0,8.9981
6488,12/31/2012 19:00,1.0,0.0,1.0,2.0,10.66,12.880,60.0,11.0014
6489,12/31/2012 20:00,1.0,0.0,1.0,2.0,10.66,12.880,60.0,11.0014
6490,12/31/2012 21:00,1.0,0.0,1.0,1.0,10.66,12.880,60.0,11.0014
6491,12/31/2012 22:00,1.0,0.0,1.0,1.0,10.66,13.635,56.0,8.9981
6492,12/31/2012 23:00,1.0,0.0,1.0,1.0,10.66,13.635,65.0,8.9981

In [127]:
#Q5 All the rows where temp>20  and humidity < 56
bike_sharing[(bike_sharing["temp"]>20)&(bike_sharing["humidity"]<56)]

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed
520,3/22/2011 13:00,2.0,0.0,1.0,1.0,20.50,24.240,45.0,15.0013
521,3/22/2011 14:00,2.0,0.0,1.0,1.0,20.50,24.240,42.0,22.0028
522,3/22/2011 15:00,2.0,0.0,1.0,1.0,20.50,24.240,42.0,15.0013
523,3/22/2011 16:00,2.0,0.0,1.0,1.0,20.50,24.240,42.0,7.0015
524,3/22/2011 17:00,2.0,0.0,1.0,1.0,20.50,24.240,42.0,7.0015
756,4/20/2011 12:00,2.0,0.0,1.0,1.0,28.70,32.575,48.0,26.0027
757,4/20/2011 13:00,2.0,0.0,1.0,1.0,28.70,32.575,48.0,26.0027
758,4/20/2011 14:00,2.0,0.0,1.0,1.0,30.34,32.575,40.0,31.0009
759,4/20/2011 15:00,2.0,0.0,1.0,2.0,31.16,33.335,35.0,23.9994
760,4/20/2011 16:00,2.0,0.0,1.0,2.0,31.16,33.335,35.0,23.9994
761,4/20/2011 17:00,2.0,0.0,1.0,2.0,30.34,32.575,37.0,27.9993
762,4/20/2011 18:00,2.0,0.0,1.0,1.0,30.34,32.575,30.0,23.9994
763,4/20/2011 19:00,2.0,0.0,1.0,1.0,28.70,31.820,32.0,16.9979
764,4/20/2011 20:00,2.0,0.0,1.0,1.0,27.88,31.060,32.0,7.0015
765,4/20/2011 21:00,2.0,0.0,1.0,1.0,27.06,31.060,36.0,19.0012
766,4/20/2011 22:00,2.0,0.0,1.0,1.0,25.42,31.060,41.0,16.9979
767,4/20/2011 23:00,2.0,0.0,1.0,1.0,24.60,31.060,40.0,22.0028
768,4/21/2011 0:00,2.0,0.0,1.0,1.0,22.96,26.515,43.0,23.9994
769,4/21/2011 1:00,2.0,0.0,1.0,1.0,21.32,25.000,45.0,15.0013
770,4/21/2011 2:00,2.0,0.0,1.0,1.0,20.50,24.240,42.0,26.0027
782,4/21/2011 14:00,2.0,0.0,1.0,1.0,20.50,24.240,34.0,26.0027
783,4/21/2011 15:00,2.0,0.0,1.0,1.0,21.32,25.000,29.0,27.9993
784,4/21/2011 16:00,2.0,0.0,1.0,1.0,21.32,25.000,27.0,23.9994
785,4/21/2011 17:00,2.0,0.0,1.0,1.0,20.50,24.240,29.0,11.0014
786,4/21/2011 18:00,2.0,0.0,1.0,1.0,20.50,24.240,25.0,19.0012
854,4/24/2011 14:00,2.0,0.0,0.0,1.0,28.70,32.575,54.0,22.0028
856,4/24/2011 16:00,2.0,0.0,0.0,1.0,30.34,33.335,48.0,26.0027
878,4/25/2011 14:00,2.0,0.0,1.0,1.0,29.52,33.335,54.0,15.0013
879,4/25/2011 15:00,2.0,0.0,1.0,1.0,30.34,33.335,51.0,15.0013
880,4/25/2011 16:00,2.0,0.0,1.0,1.0,28.70,32.575,54.0,23.9994
...,...,...,...,...,...,...,...,...,...
5750,10/22/2012 10:00,4.0,0.0,1.0,1.0,20.50,24.240,55.0,0.0000
5751,10/22/2012 11:00,4.0,0.0,1.0,1.0,22.96,26.515,37.0,11.0014
5752,10/22/2012 12:00,4.0,0.0,1.0,1.0,23.78,27.275,35.0,0.0000
5753,10/22/2012 13:00,4.0,0.0,1.0,1.0,25.42,31.060,29.0,11.0014
5754,10/22/2012 14:00,4.0,0.0,1.0,1.0,25.42,30.305,27.0,12.9980
5755,10/22/2012 15:00,4.0,0.0,1.0,1.0,26.24,31.060,29.0,11.0014
5756,10/22/2012 16:00,4.0,0.0,1.0,1.0,25.42,31.060,33.0,11.0014
5757,10/22/2012 17:00,4.0,0.0,1.0,1.0,25.42,31.060,33.0,7.0015
5759,10/22/2012 19:00,4.0,0.0,1.0,1.0,21.32,25.000,52.0,7.0015
5775,10/23/2012 11:00,4.0,0.0,1.0,1.0,24.60,31.060,53.0,0.0000
5776,10/23/2012 12:00,4.0,0.0,1.0,2.0,25.42,31.060,46.0,6.0032
5777,10/23/2012 13:00,4.0,0.0,1.0,2.0,26.24,31.060,44.0,0.0000
5778,10/23/2012 14:00,4.0,0.0,1.0,1.0,27.88,31.820,41.0,11.0014
5779,10/23/2012 15:00,4.0,0.0,1.0,1.0,27.88,31.820,41.0,15.0013
5780,10/23/2012 16:00,4.0,0.0,1.0,1.0,27.88,31.820,44.0,6.0032
5781,10/23/2012 17:00,4.0,0.0,1.0,1.0,27.88,31.820,41.0,0.0000
5782,10/23/2012 18:00,4.0,0.0,1.0,1.0,25.42,31.060,53.0,6.0032
5801,10/24/2012 13:00,4.0,0.0,1.0,1.0,27.06,31.060,54.0,0.0000
5802,10/24/2012 14:00,4.0,0.0,1.0,1.0,30.34,32.575,30.0,16.9979
5803,10/24/2012 15:00,4.0,0.0,1.0,1.0,28.70,31.820,39.0,7.0015
5804,10/24/2012 16:00,4.0,0.0,1.0,1.0,30.34,32.575,33.0,8.9981
5805,10/24/2012 17:00,4.0,0.0,1.0,1.0,27.06,31.060,47.0,0.0000
5806,10/24/2012 18:00,4.0,0.0,1.0,1.0,27.06,31.060,44.0,0.0000
5807,10/24/2012 19:00,4.0,0.0,1.0,2.0,26.24,31.060,53.0,6.0032
5872,10/27/2012 12:00,4.0,0.0,0.0,1.0,24.60,31.060,53.0,16.9979
5873,10/27/2012 13:00,4.0,0.0,0.0,1.0,24.60,31.060,43.0,16.9979
5874,10/27/2012 14:00,4.0,0.0,0.0,1.0,24.60,31.060,46.0,16.9979
5893,10/28/2012 9:00,4.0,0.0,0.0,2.0,20.50,24.240,55.0,27.9993
5895,10/28/2012 11:00,4.0,0.0,0.0,2.0,20.50,24.240,51.0,26.0027
6030,11/23/2012 14:00,4.0,0.0,1.0,1.0,20.50,24.240,36.0,16.9979

In [128]:
#Q6 Find the number of rows where windspeed > 40
bike_sharing[bike_sharing["windspeed"]>40]

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed
381,2/25/2011 14:00,1.0,0.0,1.0,3.0,22.96,26.515,56.0,40.9973
382,2/25/2011 15:00,1.0,0.0,1.0,1.0,18.86,22.725,41.0,54.0020
384,2/25/2011 17:00,1.0,0.0,1.0,1.0,13.12,13.635,49.0,50.0021
387,2/25/2011 20:00,1.0,0.0,1.0,1.0,12.30,12.880,49.0,40.9973
455,2/28/2011 19:00,1.0,0.0,1.0,3.0,18.04,21.970,88.0,40.9973
456,2/28/2011 20:00,1.0,0.0,1.0,3.0,18.04,21.970,88.0,40.9973
550,3/23/2011 20:00,2.0,0.0,1.0,3.0,14.76,15.150,87.0,43.0006
2033,8/27/2011 17:00,3.0,0.0,0.0,3.0,26.24,28.790,89.0,55.9986
2037,8/28/2011 10:00,3.0,0.0,0.0,1.0,28.70,32.575,61.0,40.9973
3626,2/24/2012 21:00,1.0,0.0,1.0,1.0,17.22,21.210,35.0,54.0020
3628,2/24/2012 23:00,1.0,0.0,1.0,1.0,15.58,19.695,37.0,46.0022
3640,2/25/2012 11:00,1.0,0.0,0.0,1.0,12.30,12.880,39.0,40.9973
3641,2/25/2012 12:00,1.0,0.0,0.0,1.0,13.12,13.635,29.0,43.9989
3905,3/26/2012 13:00,2.0,0.0,1.0,1.0,19.68,23.485,29.0,46.0022
3907,3/26/2012 15:00,2.0,0.0,1.0,1.0,19.68,23.485,29.0,40.9973
3908,3/26/2012 16:00,2.0,0.0,1.0,1.0,19.68,23.485,25.0,43.0006
5017,7/26/2012 21:00,3.0,0.0,1.0,1.0,32.80,37.120,49.0,40.9973
5018,7/26/2012 22:00,3.0,0.0,1.0,1.0,32.80,37.120,49.0,40.9973
6042,11/24/2012 2:00,4.0,0.0,0.0,1.0,13.12,13.635,39.0,40.9973
6052,11/24/2012 12:00,4.0,0.0,0.0,2.0,12.30,12.880,36.0,40.9973
6263,12/22/2012 8:00,1.0,0.0,0.0,1.0,10.66,10.605,44.0,40.9973
6267,12/22/2012 12:00,1.0,0.0,0.0,1.0,12.30,12.880,36.0,43.9989
6458,12/30/2012 13:00,1.0,0.0,0.0,1.0,12.30,12.880,36.0,43.9989

In [129]:
#Q7 Get weather and temp using loc
bike_sharing.loc[:,["weather","temp"]]

      weather   temp
0         1.0  10.66
1         1.0  10.66
2         1.0  10.66
3         1.0  10.66
4         1.0  10.66
5         1.0   9.84
6         1.0   9.02
7         1.0   9.02
8         1.0   9.02
9         2.0   9.84
10        1.0  10.66
11        2.0  11.48
12        2.0  12.30
13        2.0  11.48
14        2.0  12.30
15        2.0  13.12
16        2.0  12.30
17        2.0  12.30
18        2.0  10.66
19        1.0  10.66
20        2.0  10.66
21        2.0   9.84
22        2.0   9.84
23        2.0   9.84
24        2.0   9.84
25        2.0   9.84
26        3.0   9.84
27        3.0   9.02
28        2.0   9.02
29        1.0   9.84
...       ...    ...
6463      2.0   9.84
6464      1.0  13.94
6465      1.0   9.02
6466      1.0   8.20
6467      1.0   8.20
6468      1.0   8.20
6469      1.0   7.38
6470      1.0   7.38
6471      1.0   6.56
6472      1.0   6.56
6473      1.0   5.74
6474      1.0   6.56
6475      1.0   6.56
6476      1.0   6.56
6477      1.0   5.74
6478      2.0   7.38
6479      2.0   8.20
6480      2.0   9.02
6481      2.0   9.84
6482      2.0  10.66
6483      2.0  11.48
6484      2.0  11.48
6485      2.0  10.66
6486      2.0  10.66
6487      2.0  10.66
6488      2.0  10.66
6489      2.0  10.66
6490      1.0  10.66
6491      1.0  10.66
6492      1.0  10.66

[6493 rows x 2 columns]

In [131]:
#Q8. Get 2,3,10 index and holiday and humidity column
bike_sharing.loc[[2,3,10],["holiday","humidity"]]

    holiday  humidity
2       0.0      56.0
3       0.0      56.0
10      0.0      48.0

In [132]:
#Q9. Get rows 10 to 15 position and column with 5 to 7 position
bike_sharing.iloc[10:16,5:8].head()

     temp   atemp  humidity
10  10.66  11.365      48.0
11  11.48  13.635      45.0
12  12.30  16.665      42.0
13  11.48  14.395      45.0
14  12.30  15.150      45.0

In [145]:
#Q10. Drop the rows which contain at least one null value
bike_sharing[bike_sharing.isnull().any(axis=1)]
#bike_sharing.dropna(how="any",axis=1) - not sure what this does

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, ...]

[6493 rows x 0 columns]

In [141]:
#Q11. Drop the rows which contains all the null values
bike_sharing[bike_sharing.isnull().all(axis=1)]

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed
64,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
bike_sharing

NameError: name 'bike_sharing' is not defined

In [152]:
bike_sharing_drop = bike_sharing.dropna(how="all",axis=0,inplace=True)

In [153]:
bike_sharing_drop

In [167]:
bike_sharing_orig.shape

(6492, 9)

In [155]:
bike_sharing.shape

(6492, 9)

In [156]:
bike_sharing_drop.shape

AttributeError: 'NoneType' object has no attribute 'shape'

In [176]:
bike_sharing_drop  = bike_sharing.dropna(how="all",axis=0)

In [177]:
bike_sharing_drop.shape

(6492, 9)

In [175]:
bike_sharing.shape

(6493, 9)

In [168]:
bike_sharing_orig = bike_sharing

In [174]:
bike_sharing[bike_sharing.isnull().all(axis=1)]
#show the row where all the values in the columns(axis=1)is null

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed
64,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## 11th Aug - Class 4 - How to drop a column

In [20]:
#bike_sharing.shape
import pandas as pd
new_excel = pd.read_excel("C:/Users/tin2419/Desktop/DSFiles/timereport.xlsx",skiprows=3)
new_excel.head()

      EMPID           Name  April Month  May Month  June Month  July Month
0  99007714     Amit Purty          NaN     301.75        85.0       233.5
1  99018294  Lavanya Chapa          NaN     263.50       127.5       212.5
2  99097931    Sunil Undar          NaN     382.50       127.5       212.5
3  99112394   Yogesh Uppal          NaN     306.00       127.5       212.5
4  99119422     SURAJ JAIN          NaN     408.00       119.0       212.5

#Usually we don't get the full path name, we normally get the relative path name to read a file. We will come to this
#to skiprows=4,nrows=10000 (will fetch only 10000 records)

In [181]:
#to drop a column
bike_sharing.drop(["holiday"],axis=1)

,datetime,season,workingday,weather,temp,atemp,humidity,windspeed
0,1/20/2011 0:00,1.0,1.0,1.0,10.66,11.365,56.0,26.0027
1,1/20/2011 1:00,1.0,1.0,1.0,10.66,13.635,56.0,0.0000
2,1/20/2011 2:00,1.0,1.0,1.0,10.66,13.635,56.0,0.0000
3,1/20/2011 3:00,1.0,1.0,1.0,10.66,12.880,56.0,11.0014
4,1/20/2011 4:00,1.0,1.0,1.0,10.66,12.880,56.0,11.0014
5,1/20/2011 5:00,1.0,1.0,1.0,9.84,11.365,60.0,15.0013
6,1/20/2011 6:00,1.0,1.0,1.0,9.02,10.605,60.0,15.0013
7,1/20/2011 7:00,1.0,1.0,1.0,9.02,10.605,55.0,15.0013
8,1/20/2011 8:00,1.0,1.0,1.0,9.02,10.605,55.0,19.0012
9,1/20/2011 9:00,1.0,1.0,2.0,9.84,11.365,52.0,15.0013
10,1/20/2011 10:00,1.0,1.0,1.0,10.66,11.365,48.0,19.9995
11,1/20/2011 11:00,1.0,1.0,2.0,11.48,13.635,45.0,11.0014
12,1/20/2011 12:00,1.0,1.0,2.0,12.30,16.665,42.0,0.0000
13,1/20/2011 13:00,1.0,1.0,2.0,11.48,14.395,45.0,7.0015
14,1/20/2011 14:00,1.0,1.0,2.0,12.30,15.150,45.0,8.9981
15,1/20/2011 15:00,1.0,1.0,2.0,13.12,15.910,45.0,12.9980
16,1/20/2011 16:00,1.0,1.0,2.0,12.30,15.150,49.0,8.9981
17,1/20/2011 17:00,1.0,1.0,2.0,12.30,15.910,49.0,7.0015
18,1/20/2011 18:00,1.0,1.0,2.0,10.66,12.880,56.0,12.9980
19,1/20/2011 19:00,1.0,1.0,1.0,10.66,11.365,56.0,22.0028
20,1/20/2011 20:00,1.0,1.0,2.0,10.66,12.120,60.0,19.0012
21,1/20/2011 21:00,1.0,1.0,2.0,9.84,11.365,60.0,16.9979
22,1/20/2011 22:00,NaN,1.0,2.0,9.84,10.605,65.0,19.0012
23,1/20/2011 23:00,1.0,1.0,2.0,9.84,10.605,65.0,22.0028
24,1/21/2011 0:00,1.0,1.0,2.0,9.84,11.365,70.0,16.9979
25,1/21/2011 1:00,1.0,1.0,2.0,9.84,11.365,70.0,16.9979
26,1/21/2011 2:00,1.0,1.0,3.0,9.84,12.120,75.0,11.0014
27,1/21/2011 3:00,1.0,1.0,3.0,9.02,10.605,80.0,19.9995
28,1/21/2011 4:00,1.0,1.0,2.0,9.02,12.880,87.0,6.0032
29,1/21/2011 5:00,1.0,1.0,1.0,9.84,9.850,60.0,27.9993
...,...,...,...,...,...,...,...,...
6463,12/30/2012 18:00,1.0,0.0,2.0,9.84,10.605,44.0,19.9995
6464,12/30/2012 19:00,1.0,0.0,1.0,13.94,18.180,61.0,0.0000
6465,12/30/2012 20:00,1.0,0.0,1.0,9.02,9.850,47.0,22.0028
6466,12/30/2012 21:00,1.0,0.0,1.0,8.20,10.605,51.0,11.0014
6467,12/30/2012 22:00,1.0,0.0,1.0,8.20,9.850,55.0,12.9980
6468,12/30/2012 23:00,1.0,0.0,1.0,8.20,9.850,51.0,15.0013
6469,12/31/2012 0:00,1.0,1.0,1.0,7.38,9.090,55.0,12.9980
6470,12/31/2012 1:00,1.0,1.0,1.0,7.38,9.090,55.0,12.9980
6471,12/31/2012 2:00,1.0,1.0,1.0,6.56,8.335,59.0,11.0014
6472,12/31/2012 3:00,1.0,1.0,1.0,6.56,9.090,59.0,7.0015
6473,12/31/2012 4:00,1.0,1.0,1.0,5.74,8.335,69.0,7.0015
6474,12/31/2012 5:00,1.0,1.0,1.0,6.56,7.575,64.0,12.9980
6475,12/31/2012 6:00,1.0,1.0,1.0,6.56,8.335,64.0,11.0014
6476,12/31/2012 7:00,1.0,1.0,1.0,6.56,9.090,64.0,8.9981
6477,12/31/2012 8:00,1.0,1.0,1.0,5.74,7.575,69.0,8.9981
6478,12/31/2012 9:00,1.0,1.0,2.0,7.38,10.605,64.0,7.0015
6479,12/31/2012 10:00,1.0,1.0,2.0,8.20,10.605,69.0,8.9981
6480,12/31/2012 11:00,1.0,1.0,2.0,9.02,11.365,60.0,12.9980
6481,12/31/2012 12:00,1.0,1.0,2.0,9.84,11.365,56.0,12.9980
6482,12/31/2012 13:00,1.0,1.0,2.0,10.66,12.880,44.0,11.0014
6483,12/31/2012 14:00,1.0,1.0,2.0,11.48,13.635,45.0,15.0013
6484,12/31/2012 15:00,1.0,1.0,2.0,11.48,14.395,45.0,8.9981
6485,12/31/2012 16:00,1.0,1.0,2.0,10.66,12.880,48.0,12.9980
6486,12/31/2012 17:00,1.0,1.0,2.0,10.66,14.395,48.0,6.0032
6487,12/31/2012 18:00,1.0,1.0,2.0,10.66,13.635,48.0,8.9981
6488,12/31/2012 19:00,1.0,1.0,2.0,10.66,12.880,60.0,11.0014
6489,12/31/2012 20:00,1.0,1.0,2.0,10.66,12.880,60.0,11.0014
6490,12/31/2012 21:00,1.0,1.0,1.0,10.66,12.880,60.0,11.0014
6491,12/31/2012 22:00,1.0,1.0,1.0,10.66,13.635,56.0,8.9981
6492,12/31/2012 23:00,1.0,1.0,1.0,10.66,13.635,65.0,8.9981

In [120]:
#To drop more than one column, we have to pass it as a list
new_excel.drop(["June Month","July Month"],axis=1).head()

      EMPID           Name  April Month  May Month
0  99007714     Amit Purty          NaN     301.75
1  99018294  Lavanya Chapa          NaN     263.50
2  99097931    Sunil Undar          NaN     382.50
3  99112394   Yogesh Uppal          NaN     306.00
4  99119422     SURAJ JAIN          NaN     408.00

In [31]:
#To drop rows where some condition is met. For that we need to get an index matching that criteria
#I want to drop all the rows where temp is 9.01
#bike_sharing[bike_sharing["temp"]==9.02].index - gives us the index numbers
#bike_sharing.drop(bike_sharing[bike_sharing["temp"]==9.02].index,axis=0)
new_excel.drop(new_excel[new_excel["May Month"]==301.75].index,axis=0)
#We can avoid this if we put another column as the index as we don't have to use the above procedure

,EMPID,Name,April Month,May Month,June Month,July Month
1,99018294,Lavanya Chapa,NaN,263.50,127.5,212.50
2,99097931,Sunil Undar,NaN,382.50,127.5,212.50
3,99112394,Yogesh Uppal,NaN,306.00,127.5,212.50
4,99119422,SURAJ JAIN,NaN,408.00,119.0,212.50
5,99111227,Jyothish Kumar Bellam,NaN,374.00,119.0,204.00
6,99121343,Aditya Gaurav,NaN,374.00,119.0,204.00
7,99084053,Arun Kumar Molugu,NaN,336.00,112.0,200.00
8,99099398,Sivakumar Veluru,NaN,348.52,127.5,195.50
9,99101824,Sathish Kumar K,NaN,304.00,88.0,192.00
10,99116600,Pavan Kumar HS,NaN,336.00,128.0,192.00
11,99104115,Venu Lekkalapudi,NaN,299.00,120.0,177.00
12,99101891,Basappa Allannavar,NaN,320.00,128.0,166.00
13,439853,Krishnaprasad Damodharan,153.00,147.50,143.0,163.00
14,99114625,Arumugam Duraisamy,NaN,360.00,120.0,160.00
15,442223,Narender Loganathan,153.00,178.00,124.0,153.00
16,99088901,Gangamahesh Parasa,NaN,357.00,118.9,144.50
17,436843,Arun Govindasamy,114.75,101.75,140.5,136.25
18,442998,Prakash S,131.50,198.50,133.5,134.00
19,99101998,Bhupal Reddy,NaN,352.00,80.0,128.00
20,99117567,Manish Kumar Rajak,NaN,340.00,127.5,119.00
21,447490,Mahesh Yanamala,170.00,177.00,170.0,110.50
22,99101630,Sathish Kumar Namani,NaN,195.00,66.0,82.00
23,439840,Suneetha Narni,161.50,-13.00,98.0,78.00
24,99104131,Sneha Sharma,NaN,328.00,NaN,NaN
25,99116465,Raju Sripathi,NaN,160.00,NaN,NaN

In [33]:
new_excel.drop(new_excel[(new_excel["May Month"]==263.5)&(new_excel["June Month"]==127.5)].index,axis=0)

,EMPID,Name,April Month,May Month,June Month,July Month
0,99007714,Amit Purty,NaN,301.75,85.0,233.50
2,99097931,Sunil Undar,NaN,382.50,127.5,212.50
3,99112394,Yogesh Uppal,NaN,306.00,127.5,212.50
4,99119422,SURAJ JAIN,NaN,408.00,119.0,212.50
5,99111227,Jyothish Kumar Bellam,NaN,374.00,119.0,204.00
6,99121343,Aditya Gaurav,NaN,374.00,119.0,204.00
7,99084053,Arun Kumar Molugu,NaN,336.00,112.0,200.00
8,99099398,Sivakumar Veluru,NaN,348.52,127.5,195.50
9,99101824,Sathish Kumar K,NaN,304.00,88.0,192.00
10,99116600,Pavan Kumar HS,NaN,336.00,128.0,192.00
11,99104115,Venu Lekkalapudi,NaN,299.00,120.0,177.00
12,99101891,Basappa Allannavar,NaN,320.00,128.0,166.00
13,439853,Krishnaprasad Damodharan,153.00,147.50,143.0,163.00
14,99114625,Arumugam Duraisamy,NaN,360.00,120.0,160.00
15,442223,Narender Loganathan,153.00,178.00,124.0,153.00
16,99088901,Gangamahesh Parasa,NaN,357.00,118.9,144.50
17,436843,Arun Govindasamy,114.75,101.75,140.5,136.25
18,442998,Prakash S,131.50,198.50,133.5,134.00
19,99101998,Bhupal Reddy,NaN,352.00,80.0,128.00
20,99117567,Manish Kumar Rajak,NaN,340.00,127.5,119.00
21,447490,Mahesh Yanamala,170.00,177.00,170.0,110.50
22,99101630,Sathish Kumar Namani,NaN,195.00,66.0,82.00
23,439840,Suneetha Narni,161.50,-13.00,98.0,78.00
24,99104131,Sneha Sharma,NaN,328.00,NaN,NaN
25,99116465,Raju Sripathi,NaN,160.00,NaN,NaN

In [190]:
bike_sharing.shape

(6493, 9)

In [192]:
#DROP THE DATA WHERE TEMP IS MORE THAN 20 AND THE SEASON IS 1
bike_sharing.drop(bike_sharing[(bike_sharing["temp"]>20)&(bike_sharing["season"]==1)].index,axis=0).shape
# if we are dropping by rows we need an index

(6427, 9)

#Like SQL, we have join in Pandas also. pd.merge() is used to join two dataframes

In [201]:
empdata = pd.read_excel("C:/Users/tin2419/Desktop/DSFiles/empdata.xlsx")

In [202]:
deptdata= pd.read_excel("C:/Users/tin2419/Desktop/DSFiles/dept.xlsx")

In [203]:
pd.merge(empdata,deptdata,on="did",how="inner")
#This is an inner join

   id    name   did dname
0   1  Rajesh  10.0    IT
1   2  Roshan  20.0   FIN

In [204]:
#I want all the details irrespective of any joins - this gives inner plus the other data in the table - in this case we also got
#Prasad
pd.merge(empdata,deptdata,on="did",how="left")

   id    name   did dname
0   1  Rajesh  10.0    IT
1   2  Roshan  20.0   FIN
2   3  Prasad   NaN   NaN

#import OS will be able to find what type of files are there - whether it is .csv or .excel etc

In [205]:
#There are few depts that are not present in the employee table
pd.merge(empdata,deptdata,on="did",how="right")

    id    name   did      dname
0  1.0  Rajesh  10.0         IT
1  2.0  Roshan  20.0        FIN
2  NaN     NaN  30.0      SALES
3  NaN     NaN  40.0  MARKETING

#ASSIGNMENT - CREATE AN EMPLOYEE TABLE AND LOCATION
#EMP: EMPID, NAME, SALARY, LID
#LOCATION: LID,CITY
#TO GIVE EMPLOYEES ALOONG WITH CITY DETAILS WHERE SALARY IS GREATER THAN 40,000

In [36]:
EMPDB = pd.DataFrame({"EMPID":[1,2,3,4],"NAME":["PC","RANJ","REJO","SUNI"],"SALARY":[500,300,200,100],"LID":[20,30,40,50]})

In [37]:
LOCDB = pd.DataFrame({"LID":[20,30,40,50,60,70],"CITY":["Chennai","Bangalore","Calicut","Ooty","Cochin","Calcutta"]})

In [38]:
NEWTABLE = pd.merge(EMPDB,LOCDB,on="LID",how="inner")

In [211]:
NEWTABLE

   EMPID  NAME  SALARY  LID       CITY
0      1    PC     500   20    Chennai
1      2  RANJ     300   30  Bangalore
2      3  REJO     200   40    Calicut
3      4  SUNI     100   50       Ooty

In [41]:
ANSWER = NEWTABLE[NEWTABLE["SALARY"]>200]

In [42]:
ANSWER

   EMPID  NAME  SALARY  LID       CITY
0      1    PC     500   20    Chennai
1      2  RANJ     300   30  Bangalore

### In realtime we may be joining with multiple columns not just with one column. Also, we might need to change the columns
#df.columns = [<pass the column names] - this is done to rename the columns

In [46]:
ANSWER.columns

Index(['EMPID', 'NAME', 'SALARY', 'LID', 'CITY'], dtype='object')

In [47]:
ANSWER.columns = ["EID","NAM","SAL","LID","CTY"]

In [48]:
ANSWER
#this has changed the columns and we don't need inplace = True here. That is only applicable in dropna. So be careful

   EID   NAM  SAL  LID        CTY
0    1    PC  500   20    Chennai
1    2  RANJ  300   30  Bangalore

To join more than two columns, pass it as a list [,,,]

In [222]:
#To merget two tables - completely
bike_sharing1 = bike_sharing

In [224]:
pd.concat([bike_sharing,bike_sharing1], axis=0).shape

(12986, 9)

In [51]:
first = pd.DataFrame({"ID":[1,2,3,4],"NAME":["PC","DS","RW","TR"],"SALARY":[20,30,40,50]})

In [52]:
second = pd.DataFrame({"SID":[1,2,3,4],"NAM":["PC","DS","RW","TR"]})

In [54]:
pd.concat([first,second],axis=0)
#this will blindly concat even if it does not find the same column names. if it did not find the corresponding column names,
#it will add these new column names on top and add null as appropriate

C:\Users\tin2419\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    ID  NAM NAME  SALARY  SID
0  1.0  NaN   PC    20.0  NaN
1  2.0  NaN   DS    30.0  NaN
2  3.0  NaN   RW    40.0  NaN
3  4.0  NaN   TR    50.0  NaN
0  NaN   PC  NaN     NaN  1.0
1  NaN   DS  NaN     NaN  2.0
2  NaN   RW  NaN     NaN  3.0
3  NaN   TR  NaN     NaN  4.0

In [232]:
#To merge columns
pd.concat([first,second],axis=1)
#This will merge the two tables - no logic - it will have no nulls. If you have two tables sorted correctly then this will work.

   ID NAME  SALARY  SID NAM
0   1   PC      20    1  PC
1   2   DS      30    2  DS
2   3   RW      40    3  RW
3   4   TR      50    4  TR


#LETS LOOK AT GROUPBY

In [59]:
#The bike sharing people want to predict the number of bikes that people will take. I want season wise what is my maximum bike
#sharing. Each season we want to find the season wise maximum temperature
#bike_sharing = pd.read_csv("C:/Users/tin2419/Desktop/DSFiles/bike_sharing_python.csv")
bike_sharing.groupby("season").agg({"temp":max})

         temp
season
1.0     25.42
2.0     36.90
3.0     40.18
4.0     31.16

In [60]:
#power of groupby is that we can give many values at the same time
bike_sharing.groupby("season").agg({"temp":[max,min],"humidity":[max,min]})

         temp        humidity
          max    min      max   min
season
1.0     25.42   0.82    100.0  21.0
2.0     36.90   6.56    100.0  16.0
3.0     40.18  18.04    100.0  16.0
4.0     31.16   8.20    100.0  27.0

In [64]:
#i want season wise holiday wise max and min temperature. here we have to pass two columns in groupby
bike_sharing.groupby(["season","holiday"]).agg({"temp":["max","min"],"humidity":["max","min"]})

                 temp        humidity
                  max    min      max   min
season holiday
1.0    0.0      25.42   0.82    100.0  21.0
       1.0      17.22   8.20     93.0  26.0
2.0    0.0      36.90   6.56    100.0  16.0
       1.0      36.08  21.32     94.0  37.0
3.0    0.0      40.18  18.04    100.0  16.0
4.0    0.0      31.16   8.20    100.0  27.0
       1.0      20.50   9.02     80.0  29.0

In [237]:
#i want in a season, season-wise what is the maximum wind speed and minimum wind speed
bike_sharing.groupby("season").agg({"windspeed":[max,min]})

       windspeed
             max  min
season
1.0      54.0020  0.0
2.0      46.0022  0.0
3.0      55.9986  0.0
4.0      40.9973  0.0

In [61]:
help(bike_sharing.groupby("season"))

Help on DataFrameGroupBy in module pandas.core.groupby.generic object:

class DataFrameGroupBy(NDFrameGroupBy)
 |  DataFrameGroupBy(obj, keys=None, axis=0, level=None, grouper=None, exclusions=None, selection=None, as_index=True, sort=True, group_keys=True, squeeze=False, observed=False, **kwargs)
 |
 |  Class for grouping and aggregating relational data.
 |
 |  See aggregate, transform, and apply functions on this object.
 |
 |  It's easiest to use obj.groupby(...) to use GroupBy, but you can also do:
 |
 |  ::
 |
 |      grouped = groupby(obj, ...)
 |
 |  Parameters
 |  ----------
 |  obj : pandas object
 |  axis : int, default 0
 |  level : int, default None
 |      Level of MultiIndex
 |  groupings : list of Grouping objects
 |      Most users should ignore this
 |  exclusions : array-like, optional
 |      List of columns to exclude
 |  name : string
 |      Most users should ignore this
 |
 |  Returns
 |  -------
 |  **Attributes**
 |  groups : dict
 |      {group name -> group labels}
 |  len(grouped) : int
 |      Number of groups
 |
 |  Notes
 |  -----
 |  After grouping, see aggregate, apply, and transform functions. Here are
 |  some other brief notes about usage. When grouping by multiple groups, the
 |  result index will be a MultiIndex (hierarchical) by default.
 |
 |  Iteration produces (key, group) tuples, i.e. chunking the data by group. So
 |  you can write code like:
 |
 |  ::
 |
 |      grouped = obj.groupby(keys, axis=axis)
 |      for key, group in grouped:
 |          # do something with the data
 |
 |  Function calls on GroupBy, if not specially implemented, "dispatch" to the
 |  grouped data. So if you group a DataFrame and wish to invoke the std()
 |  method on each group, you can simply do:
 |
 |  ::
 |
 |      df.groupby(mapper).std()
 |
 |  rather than
 |
 |  ::
 |
 |      df.groupby(mapper).aggregate(np.std)
 |
 |  You can pass arguments to these "wrapped" functions, too.
 |
 |  See the online documentation for full exposition on these topics and much
 |  more
 |
 |  Method resolution order:
 |      DataFrameGroupBy
 |      NDFrameGroupBy
 |      pandas.core.groupby.groupby.GroupBy
 |      pandas.core.groupby.groupby._GroupBy
 |      pandas.core.base.PandasObject
 |      pandas.core.base.StringMixin
 |      pandas.core.accessor.DirNamesMixin
 |      pandas.core.base.SelectionMixin
 |      builtins.object
 |
 |  Methods defined here:
 |
 |  agg = aggregate(self, arg, *args, **kwargs)
 |
 |  aggregate(self, arg, *args, **kwargs)
 |      Aggregate using one or more operations over the specified axis.
 |
 |
 |
 |      Parameters
 |      ----------
 |      func : function, str, list or dict
 |          Function to use for aggregating the data. If a function, must either
 |          work when passed a DataFrame or when passed to DataFrame.apply.
 |
 |          Accepted combinations are:
 |
 |          - function
 |          - string function name
 |          - list of functions and/or function names, e.g. ``[np.sum, 'mean']``
 |          - dict of axis labels -> functions, function names or list of such.
 |
 |      *args
 |          Positional arguments to pass to `func`.
 |      **kwargs
 |          Keyword arguments to pass to `func`.
 |
 |      Returns
 |      -------
 |      DataFrame, Series or scalar
 |          if DataFrame.agg is called with a single function, returns a Series
 |          if DataFrame.agg is called with several functions, returns a DataFrame
 |          if Series.agg is called with single function, returns a scalar
 |          if Series.agg is called with several functions, returns a Series
 |
 |
 |      See Also
 |      --------
 |      pandas.DataFrame.groupby.apply
 |      pandas.DataFrame.groupby.transform
 |      pandas.DataFrame.aggregate
 |
 |
 |      Notes
 |      -----
 |      `agg` is an alias for `aggregate`. Use the alias.
 |
 |      A passed user-defined-function will be passed a Series for evaluation.
 |
 |
 |      Examples
 |      --------
 |
 |      >>> df = pd.DataFrame({'A': [1, 1, 2, 2],
 |      ...                    'B': [1, 2, 3, 4],
 |      ...                    'C': np.random.randn(4)})
 |
 |      >>> df
 |         A  B         C
 |      0  1  1  0.362838
 |      1  1  2  0.227877
 |      2  2  3  1.267767
 |      3  2  4 -0.562860
 |
 |      The aggregation is for each column.
 |
 |      >>> df.groupby('A').agg('min')
 |         B         C
 |      A
 |      1  1  0.227877
 |      2  3 -0.562860
 |
 |      Multiple aggregations
 |
 |      >>> df.groupby('A').agg(['min', 'max'])
 |          B             C
 |        min max       min       max
 |      A
 |      1   1   2  0.227877  0.362838
 |      2   3   4 -0.562860  1.267767
 |
 |      Select a column for aggregation
 |
 |      >>> df.groupby('A').B.agg(['min', 'max'])
 |         min  max
 |      A
 |      1    1    2
 |      2    3    4
 |
 |      Different aggregations per column
 |
 |      >>> df.groupby('A').agg({'B': ['min', 'max'], 'C': 'sum'})
 |          B             C
 |        min max       sum
 |      A
 |      1   1   2  0.590716
 |      2   3   4  0.704907
 |
 |  boxplot = boxplot_frame_groupby(grouped, subplots=True, column=None, fontsize=None, rot=0, grid=True, ax=None, figsize=None, layout=None, sharex=False, sharey=True, **kwds)
 |      Make box plots from DataFrameGroupBy data.
 |
 |      Parameters
 |      ----------
 |      grouped : Grouped DataFrame
 |      subplots :
 |          * ``False`` - no subplots will be used
 |          * ``True`` - create a subplot for each group
 |      column : column name or list of names, or vector
 |          Can be any valid input to groupby
 |      fontsize : int or string
 |      rot : label rotation angle
 |      grid : Setting this to True will show the grid
 |      ax : Matplotlib axis object, default None
 |      figsize : A tuple (width, height) in inches
 |      layout : tuple (optional)
 |          (rows, columns) for the layout of the plot
 |      sharex : bool, default False
 |          Whether x-axes will be shared among subplots
 |
 |          .. versionadded:: 0.23.1
 |      sharey : bool, default True
 |          Whether y-axes will be shared among subplots
 |
 |          .. versionadded:: 0.23.1
 |      `**kwds` : Keyword Arguments
 |          All other plotting keyword arguments to be passed to
 |          matplotlib's boxplot function
 |
 |      Returns
 |      -------
 |      dict of key/value = group key/DataFrame.boxplot return value
 |      or DataFrame.boxplot return value in case subplots=figures=False
 |
 |      Examples
 |      --------
 |      >>> import itertools
 |      >>> tuples = [t for t in itertools.product(range(1000), range(4))]
 |      >>> index = pd.MultiIndex.from_tuples(tuples, names=['lvl0', 'lvl1'])
 |      >>> data = np.random.randn(len(index),4)
 |      >>> df = pd.DataFrame(data, columns=list('ABCD'), index=index)
 |      >>>
 |      >>> grouped = df.groupby(level='lvl1')
 |      >>> boxplot_frame_groupby(grouped)
 |      >>>
 |      >>> grouped = df.unstack(level='lvl1').groupby(level=0, axis=1)
 |      >>> boxplot_frame_groupby(grouped, subplots=False)
 |
 |  count(self)
 |      Compute count of group, excluding missing values
 |
 |  nunique(self, dropna=True)
 |      Return DataFrame with number of distinct observations per group for
 |      each column.
 |
 |      .. versionadded:: 0.20.0
 |
 |      Parameters
 |      ----------
 |      dropna : boolean, default True
 |          Don't include NaN in the counts.
 |
 |      Returns
 |      -------
 |      nunique: DataFrame
 |
 |      Examples
 |      --------
 |      >>> df = pd.DataFrame({'id': ['spam', 'egg', 'egg', 'spam',
 |      ...                           'ham', 'ham'],
 |      ...                    'value1': [1, 5, 5, 2, 5, 5],
 |      ...                    'value2': list('abbaxy')})
 |      >>> df
 |           id  value1 value2
 |      0  spam       1      a
 |      1   egg       5      b
 |      2   egg       5      b
 |      3  spam       2      a
 |      4   ham       5      x
 |      5   ham       5      y
 |
 |      >>> df.groupby('id').nunique()
 |          id  value1  value2
 |      id
 |      egg    1       1       1
 |      ham    1       1       2
 |      spam   1       2       1
 |
 |      # check for rows with the same id but conflicting values
 |      >>> df.groupby('id').filter(lambda g: (g.nunique() > 1).any())
 |           id  value1 value2
 |      0  spam       1      a
 |      3  spam       2      a
 |      4   ham       5      x
 |      5   ham       5      y
 |
 |  ----------------------------------------------------------------------
 |  Data descriptors defined here:
 |
 |  corr
 |      Compute pairwise correlation of columns, excluding NA/null values.
 |
 |      Parameters
 |      ----------
 |      method : {'pearson', 'kendall', 'spearman'} or callable
 |          * pearson : standard correlation coefficient
 |          * kendall : Kendall Tau correlation coefficient
 |          * spearman : Spearman rank correlation
 |          * callable: callable with input two 1d ndarrays
 |              and returning a float
 |              .. versionadded:: 0.24.0
 |
 |      min_periods : int, optional
 |          Minimum number of observations required per pair of columns
 |          to have a valid result. Currently only available for pearson
 |          and spearman correlation
 |
 |      Returns
 |      -------
 |      y : DataFrame
 |
 |      See Also
 |      --------
 |      DataFrame.corrwith
 |      Series.corr
 |
 |      Examples
 |      --------
 |      >>> histogram_intersection = lambda a, b: np.minimum(a, b
 |      ... ).sum().round(decimals=1)
 |      >>> df = pd.DataFrame([(.2, .3), (.0, .6), (.6, .0), (.2, .1)],
 |      ...                   columns=['dogs', 'cats'])
 |      >>> df.corr(method=histogram_intersection)
 |            dogs cats
 |      dogs   1.0  0.3
 |      cats   0.3  1.0
 |
 |  corrwith
 |      Compute pairwise correlation between rows or columns of DataFrame
 |      with rows or columns of Series or DataFrame.  DataFrames are first
 |      aligned along both axes before computing the correlations.
 |
 |      Parameters
 |      ----------
 |      other : DataFrame, Series
 |      axis : {0 or 'index', 1 or 'columns'}, default 0
 |          0 or 'index' to compute column-wise, 1 or 'columns' for row-wise
 |      drop : boolean, default False
 |          Drop missing indices from result
 |      method : {'pearson', 'kendall', 'spearman'} or callable
 |          * pearson : standard correlation coefficient
 |          * kendall : Kendall Tau correlation coefficient
 |          * spearman : Spearman rank correlation
 |          * callable: callable with input two 1d ndarrays
 |              and returning a float
 |
 |          .. versionadded:: 0.24.0
 |
 |      Returns
 |      -------
 |      correls : Series
 |
 |      See Also
 |      -------
 |      DataFrame.corr
 |
 |  cov
 |      Compute pairwise covariance of columns, excluding NA/null values.
 |
 |      Compute the pairwise covariance among the series of a DataFrame.
 |      The returned data frame is the `covariance matrix
 |      <https://en.wikipedia.org/wiki/Covariance_matrix>`__ of the columns
 |      of the DataFrame.
 |
 |      Both NA and null values are automatically excluded from the
 |      calculation. (See the note below about bias from missing values.)
 |      A threshold can be set for the minimum number of
 |      observations for each value created. Comparisons with observations
 |      below this threshold will be returned as ``NaN``.
 |
 |      This method is generally used for the analysis of time series data to
 |      understand the relationship between different measures
 |      across time.
 |
 |      Parameters
 |      ----------
 |      min_periods : int, optional
 |          Minimum number of observations required per pair of columns
 |          to have a valid result.
 |
 |      Returns
 |      -------
 |      DataFrame
 |          The covariance matrix of the series of the DataFrame.
 |
 |      See Also
 |      --------
 |      pandas.Series.cov : Compute covariance with another Series.
 |      pandas.core.window.EWM.cov: Exponential weighted sample covariance.
 |      pandas.core.window.Expanding.cov : Expanding sample covariance.
 |      pandas.core.window.Rolling.cov : Rolling sample covariance.
 |
 |      Notes
 |      -----
 |      Returns the covariance matrix of the DataFrame's time series.
 |      The covariance is normalized by N-1.
 |
 |      For DataFrames that have Series that are missing data (assuming that
 |      data is `missing at random
 |      <https://en.wikipedia.org/wiki/Missing_data#Missing_at_random>`__)
 |      the returned covariance matrix will be an unbiased estimate
 |      of the variance and covariance between the member Series.
 |
 |      However, for many applications this estimate may not be acceptable
 |      because the estimate covariance matrix is not guaranteed to be positive
 |      semi-definite. This could lead to estimate correlations having
 |      absolute values which are greater than one, and/or a non-invertible
 |      covariance matrix. See `Estimation of covariance matrices
 |      <http://en.wikipedia.org/w/index.php?title=Estimation_of_covariance_
 |      matrices>`__ for more details.
 |
 |      Examples
 |      --------
 |      >>> df = pd.DataFrame([(1, 2), (0, 3), (2, 0), (1, 1)],
 |      ...                   columns=['dogs', 'cats'])
 |      >>> df.cov()
 |                dogs      cats
 |      dogs  0.666667 -1.000000
 |      cats -1.000000  1.666667
 |
 |      >>> np.random.seed(42)
 |      >>> df = pd.DataFrame(np.random.randn(1000, 5),
 |      ...                   columns=['a', 'b', 'c', 'd', 'e'])
 |      >>> df.cov()
 |                a         b         c         d         e
 |      a  0.998438 -0.020161  0.059277 -0.008943  0.014144
 |      b -0.020161  1.059352 -0.008543 -0.024738  0.009826
 |      c  0.059277 -0.008543  1.010670 -0.001486 -0.000271
 |      d -0.008943 -0.024738 -0.001486  0.921297 -0.013692
 |      e  0.014144  0.009826 -0.000271 -0.013692  0.977795
 |
 |      **Minimum number of periods**
 |
 |      This method also supports an optional ``min_periods`` keyword
 |      that specifies the required minimum number of non-NA observations for
 |      each column pair in order to have a valid result:
 |
 |      >>> np.random.seed(42)
 |      >>> df = pd.DataFrame(np.random.randn(20, 3),
 |      ...                   columns=['a', 'b', 'c'])
 |      >>> df.loc[df.index[:5], 'a'] = np.nan
 |      >>> df.loc[df.index[5:10], 'b'] = np.nan
 |      >>> df.cov(min_periods=12)
 |                a         b         c
 |      a  0.316741       NaN -0.150812
 |      b       NaN  1.248003  0.191417
 |      c -0.150812  0.191417  0.895202
 |
 |  diff
 |      First discrete difference of element.
 |
 |      Calculates the difference of a DataFrame element compared with another
 |      element in the DataFrame (default is the element in the same column
 |      of the previous row).
 |
 |      Parameters
 |      ----------
 |      periods : int, default 1
 |          Periods to shift for calculating difference, accepts negative
 |          values.
 |      axis : {0 or 'index', 1 or 'columns'}, default 0
 |          Take difference over rows (0) or columns (1).
 |
 |          .. versionadded:: 0.16.1.
 |
 |      Returns
 |      -------
 |      diffed : DataFrame
 |
 |      See Also
 |      --------
 |      Series.diff: First discrete difference for a Series.
 |      DataFrame.pct_change: Percent change over given number of periods.
 |      DataFrame.shift: Shift index by desired number of periods with an
 |          optional time freq.
 |
 |      Examples
 |      --------
 |      Difference with previous row
 |
 |      >>> df = pd.DataFrame({'a': [1, 2, 3, 4, 5, 6],
 |      ...                    'b': [1, 1, 2, 3, 5, 8],
 |      ...                    'c': [1, 4, 9, 16, 25, 36]})
 |      >>> df
 |         a  b   c
 |      0  1  1   1
 |      1  2  1   4
 |      2  3  2   9
 |      3  4  3  16
 |      4  5  5  25
 |      5  6  8  36
 |
 |      >>> df.diff()
 |           a    b     c
 |      0  NaN  NaN   NaN
 |      1  1.0  0.0   3.0
 |      2  1.0  1.0   5.0
 |      3  1.0  1.0   7.0
 |      4  1.0  2.0   9.0
 |      5  1.0  3.0  11.0
 |
 |      Difference with previous column
 |
 |      >>> df.diff(axis=1)
 |          a    b     c
 |      0 NaN  0.0   0.0
 |      1 NaN -1.0   3.0
 |      2 NaN -1.0   7.0
 |      3 NaN -1.0  13.0
 |      4 NaN  0.0  20.0
 |      5 NaN  2.0  28.0
 |
 |      Difference with 3rd previous row
 |
 |      >>> df.diff(periods=3)
 |           a    b     c
 |      0  NaN  NaN   NaN
 |      1  NaN  NaN   NaN
 |      2  NaN  NaN   NaN
 |      3  3.0  2.0  15.0
 |      4  3.0  4.0  21.0
 |      5  3.0  6.0  27.0
 |
 |      Difference with following row
 |
 |      >>> df.diff(periods=-1)
 |           a    b     c
 |      0 -1.0  0.0  -3.0
 |      1 -1.0 -1.0  -5.0
 |      2 -1.0 -1.0  -7.0
 |      3 -1.0 -2.0  -9.0
 |      4 -1.0 -3.0 -11.0
 |      5  NaN  NaN   NaN
 |
 |  dtypes
 |      Return the dtypes in the DataFrame.
 |
 |      This returns a Series with the data type of each column.
 |      The result's index is the original DataFrame's columns. Columns
 |      with mixed types are stored with the ``object`` dtype. See
 |      :ref:`the User Guide <basics.dtypes>` for more.
 |
 |      Returns
 |      -------
 |      pandas.Series
 |          The data type of each column.
 |
 |      See Also
 |      --------
 |      pandas.DataFrame.ftypes : Dtype and sparsity information.
 |
 |      Examples
 |      --------
 |      >>> df = pd.DataFrame({'float': [1.0],
 |      ...                    'int': [1],
 |      ...                    'datetime': [pd.Timestamp('20180310')],
 |      ...                    'string': ['foo']})
 |      >>> df.dtypes
 |      float              float64
 |      int                  int64
 |      datetime    datetime64[ns]
 |      string              object
 |      dtype: object
 |
 |  fillna
 |      Fill NA/NaN values using the specified method.
 |
 |      Parameters
 |      ----------
 |      value : scalar, dict, Series, or DataFrame
 |          Value to use to fill holes (e.g. 0), alternately a
 |          dict/Series/DataFrame of values specifying which value to use for
 |          each index (for a Series) or column (for a DataFrame). (values not
 |          in the dict/Series/DataFrame will not be filled). This value cannot
 |          be a list.
 |      method : {'backfill', 'bfill', 'pad', 'ffill', None}, default None
 |          Method to use for filling holes in reindexed Series
 |          pad / ffill: propagate last valid observation forward to next valid
 |          backfill / bfill: use NEXT valid observation to fill gap
 |      axis : {0 or 'index', 1 or 'columns'}
 |      inplace : boolean, default False
 |          If True, fill in place. Note: this will modify any
 |          other views on this object, (e.g. a no-copy slice for a column in a
 |          DataFrame).
 |      limit : int, default None
 |          If method is specified, this is the maximum number of consecutive
 |          NaN values to forward/backward fill. In other words, if there is
 |          a gap with more than this number of consecutive NaNs, it will only
 |          be partially filled. If method is not specified, this is the
 |          maximum number of entries along the entire axis where NaNs will be
 |          filled. Must be greater than 0 if not None.
 |      downcast : dict, default is None
 |          a dict of item->dtype of what to downcast if possible,
 |          or the string 'infer' which will try to downcast to an appropriate
 |          equal type (e.g. float64 to int64 if possible)
 |
 |      Returns
 |      -------
 |      filled : DataFrame
 |
 |      See Also
 |      --------
 |      interpolate : Fill NaN values using interpolation.
 |      reindex, asfreq
 |

In [63]:
#i want season-wise mean temperature - assignment
bike_sharing.groupby("season").agg({"temp":"mean"})

             temp
season
1.0     11.821534
2.0     21.528425
3.0     29.232093
4.0     18.625167

#To change data types

In [246]:
bike_sharing.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6493 entries, 0 to 6492
Data columns (total 9 columns):
datetime      6492 non-null object
season        6489 non-null float64
holiday       6491 non-null float64
workingday    6490 non-null float64
weather       6490 non-null float64
temp          6490 non-null float64
atemp         6490 non-null float64
humidity      6491 non-null float64
windspeed     6491 non-null float64
dtypes: float64(8), object(1)
memory usage: 456.6+ KB

In [247]:
#To convert season into a string. but remember to overwrite the same column otherwise the change will not be permanent
bike_sharing["season"] = bike_sharing["season"].astype("object")

In [248]:
bike_sharing.info()
# the season was converted into an object here

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6493 entries, 0 to 6492
Data columns (total 9 columns):
datetime      6492 non-null object
season        6489 non-null object
holiday       6491 non-null float64
workingday    6490 non-null float64
weather       6490 non-null float64
temp          6490 non-null float64
atemp         6490 non-null float64
humidity      6491 non-null float64
windspeed     6491 non-null float64
dtypes: float64(7), object(2)
memory usage: 456.6+ KB

In [249]:
#how to identify if a category or an object has space. For example, how many unique seasons and their frequency but this
#does not show the null values
bike_sharing["season"].value_counts()

3.0    1763
2.0    1676
1.0    1552
4.0    1498
Name: season, dtype: int64

In [250]:
#To find unique values
bike_sharing["season"].unique()

array([1.0, nan, 2.0, 3.0, 4.0], dtype=object)

In [252]:
#help(bike_sharing["season"].value_counts())

In [253]:
bike_sharing[bike_sharing.isnull().any(axis=1)]
#here it will not take axis =0, it will take by column - if any of the column is null is the only one taken

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed
22,1/20/2011 22:00,NaN,0.0,1.0,2.0,9.84,10.605,65.0,19.0012
42,1/21/2011 18:00,1,0.0,1.0,NaN,4.92,6.060,30.0,16.9979
47,1/21/2011 23:00,1,0.0,1.0,1.0,2.46,NaN,38.0,22.0028
64,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
80,1/23/2011 10:00,NaN,0.0,0.0,1.0,5.74,5.305,46.0,26.0027
139,1/25/2011 23:00,1,0.0,1.0,2.0,NaN,11.365,64.0,11.0014
163,1/27/2011 23:00,1,0.0,NaN,1.0,7.38,9.850,80.0,11.0014
193,1/29/2011 7:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

#we can do value_counts once we have found the null values (usually in the beginning of analysis)

#in bike sharing, instead of numeric temp , i want to convert it into a range or a category. We want to temp column like this. 
# this is called binning

In [254]:
temp_bin=[0,10,20,30,40]

In [255]:
bin_labels = ["0-10","10-20","20-30","30-40"]
#This is a string. we can give anything we want

In [257]:
pd.cut(bike_sharing["temp"],bins=temp_bin,labels=bin_labels)
#pd.cut, pass the column you want to bin. in bins pass how many bins we want to create and what is your labels.pd.cut will form 
# a bin between "0-10" and "0", "10-20" and "10"

0       10-20
1       10-20
2       10-20
3       10-20
4       10-20
5        0-10
6        0-10
7        0-10
8        0-10
9        0-10
10      10-20
11      10-20
12      10-20
13      10-20
14      10-20
15      10-20
16      10-20
17      10-20
18      10-20
19      10-20
20      10-20
21       0-10
22       0-10
23       0-10
24       0-10
25       0-10
26       0-10
27       0-10
28       0-10
29       0-10
        ...
6463     0-10
6464    10-20
6465     0-10
6466     0-10
6467     0-10
6468     0-10
6469     0-10
6470     0-10
6471     0-10
6472     0-10
6473     0-10
6474     0-10
6475     0-10
6476     0-10
6477     0-10
6478     0-10
6479     0-10
6480     0-10
6481     0-10
6482    10-20
6483    10-20
6484    10-20
6485    10-20
6486    10-20
6487    10-20
6488    10-20
6489    10-20
6490    10-20
6491    10-20
6492    10-20
Name: temp, Length: 6493, dtype: category
Categories (4, object): [0-10 < 10-20 < 20-30 < 30-40]

In [258]:
#Creating a new column called temp_range
bike_sharing["temp_range"] = pd.cut(bike_sharing["temp"],bins=temp_bin,labels=bin_labels)

In [259]:
bike_sharing.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,temp_range
0,1/20/2011 0:00,1,0.0,1.0,1.0,10.66,11.365,56.0,26.0027,10-20
1,1/20/2011 1:00,1,0.0,1.0,1.0,10.66,13.635,56.0,0.0000,10-20
2,1/20/2011 2:00,1,0.0,1.0,1.0,10.66,13.635,56.0,0.0000,10-20
3,1/20/2011 3:00,1,0.0,1.0,1.0,10.66,12.880,56.0,11.0014,10-20
4,1/20/2011 4:00,1,0.0,1.0,1.0,10.66,12.880,56.0,11.0014,10-20

#THIS IS HOW WE CONVERT A NUMERIC COLUMN TO A RANGE

In [260]:
#Convert the windspeed column to a range 0,20,40,60
wind_bin = [0,20,40,60]
bin_labels = ["0-20","20-40","40-60"]
bike_sharing["windspeed_range"]=pd.cut(bike_sharing["windspeed"],bins=wind_bin,labels=bin_labels)
#Created a new column called 'windspeed_range'

In [262]:
bike_sharing.head(20)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,temp_range,windspeed_range
0,1/20/2011 0:00,1,0.0,1.0,1.0,10.66,11.365,56.0,26.0027,10-20,20-40
1,1/20/2011 1:00,1,0.0,1.0,1.0,10.66,13.635,56.0,0.0000,10-20,NaN
2,1/20/2011 2:00,1,0.0,1.0,1.0,10.66,13.635,56.0,0.0000,10-20,NaN
3,1/20/2011 3:00,1,0.0,1.0,1.0,10.66,12.880,56.0,11.0014,10-20,0-20
4,1/20/2011 4:00,1,0.0,1.0,1.0,10.66,12.880,56.0,11.0014,10-20,0-20
5,1/20/2011 5:00,1,0.0,1.0,1.0,9.84,11.365,60.0,15.0013,0-10,0-20
6,1/20/2011 6:00,1,0.0,1.0,1.0,9.02,10.605,60.0,15.0013,0-10,0-20
7,1/20/2011 7:00,1,0.0,1.0,1.0,9.02,10.605,55.0,15.0013,0-10,0-20
8,1/20/2011 8:00,1,0.0,1.0,1.0,9.02,10.605,55.0,19.0012,0-10,0-20
9,1/20/2011 9:00,1,0.0,1.0,2.0,9.84,11.365,52.0,15.0013,0-10,0-20
10,1/20/2011 10:00,1,0.0,1.0,1.0,10.66,11.365,48.0,19.9995,10-20,0-20
11,1/20/2011 11:00,1,0.0,1.0,2.0,11.48,13.635,45.0,11.0014,10-20,0-20
12,1/20/2011 12:00,1,0.0,1.0,2.0,12.30,16.665,42.0,0.0000,10-20,NaN
13,1/20/2011 13:00,1,0.0,1.0,2.0,11.48,14.395,45.0,7.0015,10-20,0-20
14,1/20/2011 14:00,1,0.0,1.0,2.0,12.30,15.150,45.0,8.9981,10-20,0-20
15,1/20/2011 15:00,1,0.0,1.0,2.0,13.12,15.910,45.0,12.9980,10-20,0-20
16,1/20/2011 16:00,1,0.0,1.0,2.0,12.30,15.150,49.0,8.9981,10-20,0-20
17,1/20/2011 17:00,1,0.0,1.0,2.0,12.30,15.910,49.0,7.0015,10-20,0-20
18,1/20/2011 18:00,1,0.0,1.0,2.0,10.66,12.880,56.0,12.9980,10-20,0-20
19,1/20/2011 19:00,1,0.0,1.0,1.0,10.66,11.365,56.0,22.0028,10-20,20-40

In [264]:
#There is another kind of binning to do on existing code
bike_sharing.loc[(bike_sharing["temp"]>0) & (bike_sharing["temp"]<10),"New_temp"] = "0-10"
#Usually this is not preferred but same thing can be done easier using pd.cut
#bike_sharing.loc[(bike_sharing["temp"]>10) & (bike_sharing["temp"]<20),"New_temp"] = "10-20"
#If you use the second line, then it will update for all the columns of 10-20.

In [266]:
bike_sharing.head(20)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,temp_range,windspeed_range,New_temp
0,1/20/2011 0:00,1,0.0,1.0,1.0,10.66,11.365,56.0,26.0027,10-20,20-40,NaN
1,1/20/2011 1:00,1,0.0,1.0,1.0,10.66,13.635,56.0,0.0000,10-20,NaN,NaN
2,1/20/2011 2:00,1,0.0,1.0,1.0,10.66,13.635,56.0,0.0000,10-20,NaN,NaN
3,1/20/2011 3:00,1,0.0,1.0,1.0,10.66,12.880,56.0,11.0014,10-20,0-20,NaN
4,1/20/2011 4:00,1,0.0,1.0,1.0,10.66,12.880,56.0,11.0014,10-20,0-20,NaN
5,1/20/2011 5:00,1,0.0,1.0,1.0,9.84,11.365,60.0,15.0013,0-10,0-20,0-10
6,1/20/2011 6:00,1,0.0,1.0,1.0,9.02,10.605,60.0,15.0013,0-10,0-20,0-10
7,1/20/2011 7:00,1,0.0,1.0,1.0,9.02,10.605,55.0,15.0013,0-10,0-20,0-10
8,1/20/2011 8:00,1,0.0,1.0,1.0,9.02,10.605,55.0,19.0012,0-10,0-20,0-10
9,1/20/2011 9:00,1,0.0,1.0,2.0,9.84,11.365,52.0,15.0013,0-10,0-20,0-10
10,1/20/2011 10:00,1,0.0,1.0,1.0,10.66,11.365,48.0,19.9995,10-20,0-20,NaN
11,1/20/2011 11:00,1,0.0,1.0,2.0,11.48,13.635,45.0,11.0014,10-20,0-20,NaN
12,1/20/2011 12:00,1,0.0,1.0,2.0,12.30,16.665,42.0,0.0000,10-20,NaN,NaN
13,1/20/2011 13:00,1,0.0,1.0,2.0,11.48,14.395,45.0,7.0015,10-20,0-20,NaN
14,1/20/2011 14:00,1,0.0,1.0,2.0,12.30,15.150,45.0,8.9981,10-20,0-20,NaN
15,1/20/2011 15:00,1,0.0,1.0,2.0,13.12,15.910,45.0,12.9980,10-20,0-20,NaN
16,1/20/2011 16:00,1,0.0,1.0,2.0,12.30,15.150,49.0,8.9981,10-20,0-20,NaN
17,1/20/2011 17:00,1,0.0,1.0,2.0,12.30,15.910,49.0,7.0015,10-20,0-20,NaN
18,1/20/2011 18:00,1,0.0,1.0,2.0,10.66,12.880,56.0,12.9980,10-20,0-20,NaN
19,1/20/2011 19:00,1,0.0,1.0,1.0,10.66,11.365,56.0,22.0028,10-20,20-40,NaN

## What is map
### map(function,iterable in list)

In [76]:
#help(pd.read_csv)
#olympic_data = pd.read_csv("C:/Users/tin2419/Desktop/DSFiles/olympics.csv",skiprows=4)
#olympic_data.head() 
#To create a column where we can map some countries to some of the cities. The functionality is actually map

country_map={"Athens":"Greek","Berlin":"Russia"}
#olympic_data["city"].map(country_map)- for the key value - city, it will return me Athens
olympic_data["country"] = olympic_data["City"].map(country_map) 
#will create a new column called 'country' and match the values
olympic_data.head()

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal,Country,country
0,Athens,1896.0,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100m freestyle,M,Gold,Greek,Greek
1,Athens,1896.0,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100m freestyle,M,Silver,Greek,Greek
2,Athens,1896.0,Aquatics,Swimming,NaN,AUT,Men,100m freestyle,M,Silver,Greek,Greek
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Athens,1896.0,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100m freestyle for sailors,M,Gold,Greek,Greek

In [79]:
#map(square,[1,2,3,4]) 
#this will square the list

In [82]:
#in few cases, we will need to replace some values. WE have a method called replace
#olympic_data["Sport"].replace("Aquatics","Water Sports")
olympic_data["Sport"].replace({"Aquatics":"Water Sports","Athletics":"Running"})

0        Water Sports
1        Water Sports
2        Water Sports
3                 NaN
4        Water Sports
5        Water Sports
6        Water Sports
7        Water Sports
8        Water Sports
9        Water Sports
10       Water Sports
11       Water Sports
12            Running
13            Running
14            Running
15            Running
16            Running
17            Running
18            Running
19            Running
20            Running
21            Running
22            Running
23            Running
24            Running
25            Running
26            Running
27            Running
28            Running
29            Running
             ...
29187       Wrestling
29188       Wrestling
29189       Wrestling
29190       Wrestling
29191       Wrestling
29192       Wrestling
29193       Wrestling
29194       Wrestling
29195       Wrestling
29196       Wrestling
29197       Wrestling
29198       Wrestling
29199       Wrestling
29200       Wrestling
29201       Wrestling
29202       Wrestling
29203       Wrestling
29204       Wrestling
29205       Wrestling
29206       Wrestling
29207       Wrestling
29208       Wrestling
29209       Wrestling
29210       Wrestling
29211       Wrestling
29212       Wrestling
29213       Wrestling
29214       Wrestling
29215       Wrestling
29216       Wrestling
Name: Sport, Length: 29217, dtype: object

In [271]:
amount=pd.Series(["$20000","$30000"])
#Instead of DataFrame, we could use Series

In [272]:
amount

0    $20000
1    $30000
dtype: object

In [273]:
amount.replace("$","")

0    $20000
1    $30000
dtype: object

In [274]:
type(amount)

pandas.core.series.Series

In [275]:
#this will not work as replace is a string function. 
amount.str.replace("$","")

0    20000
1    30000
dtype: object

In [276]:
#Earlier we replacing Athens we are not replacing part of the value. When we need to replace part of 
# the value, then we will have to convert it into a string. Like if we replace 20000 with 25000 then 
#we don't need a string.str. But to convert a part,we need to convert it into a string

In [277]:
bike_sharing.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6493 entries, 0 to 6492
Data columns (total 12 columns):
datetime           6492 non-null object
season             6489 non-null object
holiday            6491 non-null float64
workingday         6490 non-null float64
weather            6490 non-null float64
temp               6490 non-null float64
atemp              6490 non-null float64
humidity           6491 non-null float64
windspeed          6491 non-null float64
temp_range         6489 non-null category
windspeed_range    5625 non-null category
New_temp           751 non-null object
dtypes: category(2), float64(7), object(3)
memory usage: 520.3+ KB

In [278]:
#here to convert the datetime to a datetime object we use pd.to_datetime
bike_sharing.head()
# here datetime is a sring type, if i want the hour,date etc, then i will have to do string slicing 
#which will make the coding complex. Converting into pandas datetime

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,temp_range,windspeed_range,New_temp
0,1/20/2011 0:00,1,0.0,1.0,1.0,10.66,11.365,56.0,26.0027,10-20,20-40,NaN
1,1/20/2011 1:00,1,0.0,1.0,1.0,10.66,13.635,56.0,0.0000,10-20,NaN,NaN
2,1/20/2011 2:00,1,0.0,1.0,1.0,10.66,13.635,56.0,0.0000,10-20,NaN,NaN
3,1/20/2011 3:00,1,0.0,1.0,1.0,10.66,12.880,56.0,11.0014,10-20,0-20,NaN
4,1/20/2011 4:00,1,0.0,1.0,1.0,10.66,12.880,56.0,11.0014,10-20,0-20,NaN

In [85]:
bike_sharing["datetime"]=pd.to_datetime(bike_sharing["datetime"])

In [84]:
bike_sharing.info()
#Now it has become a datetime object

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6493 entries, 0 to 6492
Data columns (total 9 columns):
datetime      6492 non-null object
season        6489 non-null float64
holiday       6491 non-null float64
workingday    6490 non-null float64
weather       6490 non-null float64
temp          6490 non-null float64
atemp         6490 non-null float64
humidity      6491 non-null float64
windspeed     6491 non-null float64
dtypes: float64(8), object(1)
memory usage: 456.6+ KB

In [87]:
bike_sharing["datetime"].dt.hour.head()
#type(bike_sharing["datetime"].dt.hour)# it is a series

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
Name: datetime, dtype: float64

In [286]:
bike_sharing["datetime"].dt.date.head()

0    2011-01-20
1    2011-01-20
2    2011-01-20
3    2011-01-20
4    2011-01-20
Name: datetime, dtype: object

In [287]:
bike_sharing["datetime"].dt.day.head()

0    20.0
1    20.0
2    20.0
3    20.0
4    20.0
Name: datetime, dtype: float64

In [288]:
bike_sharing["datetime"].dt.month.head()

0    1.0
1    1.0
2    1.0
3    1.0
4    1.0
Name: datetime, dtype: float64

In [289]:
bike_sharing["datetime"].dt.year.head()

0    2011.0
1    2011.0
2    2011.0
3    2011.0
4    2011.0
Name: datetime, dtype: float64

In [88]:
#To get day of the week
bike_sharing["datetime"].dt.weekday_name.head()

0    Thursday
1    Thursday
2    Thursday
3    Thursday
4    Thursday
Name: datetime, dtype: object

In [291]:
#to name the day of the week - check help
pd.to_datetime("05/10/2010")
#weekday_name is there to get the name of the week

Timestamp('2010-05-10 00:00:00')

In [293]:
#WE can give the format 
pd.to_datetime("05/10/2019",format="%d/%m/%Y")

Timestamp('2019-10-05 00:00:00')

In [299]:
#convert into pandas date format and get me the date, year and month
date_str1='Wednesday,June 6,2018'
date_str2='6/6/18'
date_str3='06-06-2018'

Timestamp('2018-06-06 00:00:00')

In [304]:
#Converting the above into pandas datetime
pd.to_datetime(date_str1,format ='%A,%B %m,%Y')

Timestamp('2018-06-01 00:00:00')

In [312]:
pd.to_datetime(date_str2,format ='%m/%d/%y')

Timestamp('2018-06-06 00:00:00')

In [313]:
pd.to_datetime(date_str3,format='%m-%d-%Y')

Timestamp('2018-06-06 00:00:00')

In [315]:
pd.to_datetime(bike_sharing["datetime"]).head()

0   2011-01-20 00:00:00
1   2011-01-20 01:00:00
2   2011-01-20 02:00:00
3   2011-01-20 03:00:00
4   2011-01-20 04:00:00
Name: datetime, dtype: datetime64[ns]

In [92]:
#Give me all the rows where datetime > '2010-01-01' 
bike_sharing[pd.to_datetime(bike_sharing["datetime"])>'2010-01-01'].shape
#bike_sharing[bike_sharing["datetime"]>"2010-01-01"].shape

(6492, 9)

In [121]:
#convert it into '01/01/2010' and then compare
#bike_sharing[pd.to_datetime(bike_sharing["datetime"],format='%d/%m/%Y') > '01/01/2010']
#This is how you can play around with the date

#ASSIGNMENT - PRACTICE EVERYTHING WITH BITE SHARING DATA
help(pd.to_datetime)

Help on function to_datetime in module pandas.core.tools.datetimes:

to_datetime(arg, errors='raise', dayfirst=False, yearfirst=False, utc=None, box=True, format=None, exact=True, unit=None, infer_datetime_format=False, origin='unix', cache=False)
    Convert argument to datetime.

    Parameters
    ----------
    arg : integer, float, string, datetime, list, tuple, 1-d array, Series

        .. versionadded:: 0.18.1

           or DataFrame/dict-like

    errors : {'ignore', 'raise', 'coerce'}, default 'raise'

        - If 'raise', then invalid parsing will raise an exception
        - If 'coerce', then invalid parsing will be set as NaT
        - If 'ignore', then invalid parsing will return the input
    dayfirst : boolean, default False
        Specify a date parse order if `arg` is str or its list-likes.
        If True, parses dates with the day first, eg 10/11/12 is parsed as
        2012-11-10.
        Warning: dayfirst=True is not strict, but will prefer to parse
        with day first (this is a known bug, based on dateutil behavior).
    yearfirst : boolean, default False
        Specify a date parse order if `arg` is str or its list-likes.

        - If True parses dates with the year first, eg 10/11/12 is parsed as
          2010-11-12.
        - If both dayfirst and yearfirst are True, yearfirst is preceded (same
          as dateutil).

        Warning: yearfirst=True is not strict, but will prefer to parse
        with year first (this is a known bug, based on dateutil behavior).

        .. versionadded:: 0.16.1

    utc : boolean, default None
        Return UTC DatetimeIndex if True (converting any tz-aware
        datetime.datetime objects as well).
    box : boolean, default True

        - If True returns a DatetimeIndex or Index-like object
        - If False returns ndarray of values.
    format : string, default None
        strftime to parse time, eg "%d/%m/%Y", note that "%f" will parse
        all the way up to nanoseconds.
    exact : boolean, True by default

        - If True, require an exact format match.
        - If False, allow the format to match anywhere in the target string.

    unit : string, default 'ns'
        unit of the arg (D,s,ms,us,ns) denote the unit, which is an
        integer or float number. This will be based off the origin.
        Example, with unit='ms' and origin='unix' (the default), this
        would calculate the number of milliseconds to the unix epoch start.
    infer_datetime_format : boolean, default False
        If True and no `format` is given, attempt to infer the format of the
        datetime strings, and if it can be inferred, switch to a faster
        method of parsing them. In some cases this can increase the parsing
        speed by ~5-10x.
    origin : scalar, default is 'unix'
        Define the reference date. The numeric values would be parsed as number
        of units (defined by `unit`) since this reference date.

        - If 'unix' (or POSIX) time; origin is set to 1970-01-01.
        - If 'julian', unit must be 'D', and origin is set to beginning of
          Julian Calendar. Julian day number 0 is assigned to the day starting
          at noon on January 1, 4713 BC.
        - If Timestamp convertible, origin is set to Timestamp identified by
          origin.

        .. versionadded:: 0.20.0
    cache : boolean, default False
        If True, use a cache of unique, converted dates to apply the datetime
        conversion. May produce significant speed-up when parsing duplicate
        date strings, especially ones with timezone offsets.

        .. versionadded:: 0.23.0

    Returns
    -------
    ret : datetime if parsing succeeded.
        Return type depends on input:

        - list-like: DatetimeIndex
        - Series: Series of datetime64 dtype
        - scalar: Timestamp

        In case when it is not possible to return designated types (e.g. when
        any element of input is before Timestamp.min or after Timestamp.max)
        return will have datetime.datetime type (or corresponding
        array/Series).

    See Also
    --------
    pandas.DataFrame.astype : Cast argument to a specified dtype.
    pandas.to_timedelta : Convert argument to timedelta.

    Examples
    --------
    Assembling a datetime from multiple columns of a DataFrame. The keys can be
    common abbreviations like ['year', 'month', 'day', 'minute', 'second',
    'ms', 'us', 'ns']) or plurals of the same

    >>> df = pd.DataFrame({'year': [2015, 2016],
                           'month': [2, 3],
                           'day': [4, 5]})
    >>> pd.to_datetime(df)
    0   2015-02-04
    1   2016-03-05
    dtype: datetime64[ns]

    If a date does not meet the `timestamp limitations
    <http://pandas.pydata.org/pandas-docs/stable/timeseries.html
    #timeseries-timestamp-limits>`_, passing errors='ignore'
    will return the original input instead of raising any exception.

    Passing errors='coerce' will force an out-of-bounds date to NaT,
    in addition to forcing non-dates (or non-parseable dates) to NaT.

    >>> pd.to_datetime('13000101', format='%Y%m%d', errors='ignore')
    datetime.datetime(1300, 1, 1, 0, 0)
    >>> pd.to_datetime('13000101', format='%Y%m%d', errors='coerce')
    NaT

    Passing infer_datetime_format=True can often-times speedup a parsing
    if its not an ISO8601 format exactly, but in a regular format.

    >>> s = pd.Series(['3/11/2000', '3/12/2000', '3/13/2000']*1000)

    >>> s.head()
    0    3/11/2000
    1    3/12/2000
    2    3/13/2000
    3    3/11/2000
    4    3/12/2000
    dtype: object

    >>> %timeit pd.to_datetime(s,infer_datetime_format=True)
    100 loops, best of 3: 10.4 ms per loop

    >>> %timeit pd.to_datetime(s,infer_datetime_format=False)
    1 loop, best of 3: 471 ms per loop

    Using a unix epoch time

    >>> pd.to_datetime(1490195805, unit='s')
    Timestamp('2017-03-22 15:16:45')
    >>> pd.to_datetime(1490195805433502912, unit='ns')
    Timestamp('2017-03-22 15:16:45.433502912')

    .. warning:: For float arg, precision rounding might happen. To prevent
        unexpected behavior use a fixed-width exact type.

    Using a non-unix epoch origin

    >>> pd.to_datetime([1, 2, 3], unit='D',
                       origin=pd.Timestamp('1960-01-01'))
    0    1960-01-02
    1    1960-01-03
    2    1960-01-04

In [ ]:
pd.to_datetime(bike_sharing_date,format='%m-%d-%Y')